zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
/**
  ******************************************************************************
  * @file    stm32mp133dxx_ca7.h
  * @author  MCD Application Team
  * @brief   CMSIS stm32mp133dxx_ca7 Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripherals registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32mp133dxx_ca7
  * @{
  */

#ifndef __STM32MP133Dxx_CA7_H
#define __STM32MP133Dxx_CA7_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/**
  * @brief Bit position definition inside a 32 bits registers
  */
#define  B(x) \
        ((uint32_t) 1 << x)
/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief STM32MP13XX Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
 typedef enum IRQn
 {
   /******  Cortex-A Processor Specific Interrupt Numbers ***************************************************************/
   /* Software Generated Interrupts                                                                                     */
   SGI0_IRQn                        =  0,     /*!< Software Generated Interrupt  0                                      */
   SGI1_IRQn                        =  1,     /*!< Software Generated Interrupt  1                                      */
   SGI2_IRQn                        =  2,     /*!< Software Generated Interrupt  2                                      */
   SGI3_IRQn                        =  3,     /*!< Software Generated Interrupt  3                                      */
   SGI4_IRQn                        =  4,     /*!< Software Generated Interrupt  4                                      */
   SGI5_IRQn                        =  5,     /*!< Software Generated Interrupt  5                                      */
   SGI6_IRQn                        =  6,     /*!< Software Generated Interrupt  6                                      */
   SGI7_IRQn                        =  7,     /*!< Software Generated Interrupt  7                                      */
   SGI8_IRQn                        =  8,     /*!< Software Generated Interrupt  8                                      */
   SGI9_IRQn                        =  9,     /*!< Software Generated Interrupt  9                                      */
   SGI10_IRQn                       = 10,     /*!< Software Generated Interrupt 10                                      */
   SGI11_IRQn                       = 11,     /*!< Software Generated Interrupt 11                                      */
   SGI12_IRQn                       = 12,     /*!< Software Generated Interrupt 12                                      */
   SGI13_IRQn                       = 13,     /*!< Software Generated Interrupt 13                                      */
   SGI14_IRQn                       = 14,     /*!< Software Generated Interrupt 14                                      */
   SGI15_IRQn                       = 15,     /*!< Software Generated Interrupt 15                                      */
   /* Private Peripheral Interrupts                                                                                     */
   VirtualMaintenanceInterrupt_IRQn = 25,     /*!< Virtual Maintenance Interrupt                                        */
   HypervisorTimer_IRQn             = 26,     /*!< Hypervisor Timer Interrupt                                           */
   VirtualTimer_IRQn                = 27,     /*!< Virtual Timer Interrupt                                              */
   Legacy_nFIQ_IRQn                 = 28,     /*!< Legacy nFIQ Interrupt                                                */
   SecurePhyTimer_IRQn              = 29,     /*!< Secure Physical Timer Interrupt                                      */
   NonSecurePhyTimer_IRQn           = 30,     /*!< Non-Secure Physical Timer Interrupt                                  */
   Legacy_nIRQ_IRQn                 = 31,     /*!< Legacy nIRQ Interrupt                                                */
   /******  STM32 specific Interrupt Numbers ****************************************************************************/
   RESERVED_32                      = 32,     /*!< RESERVED interrupt                                                   */
   PVD_AVD_IRQn                     = 33,     /*!< PVD & AVD detector through EXTI                                      */
   TAMP_IRQn                        = 34,     /*!< Tamper interrupts through the EXTI line                              */
   RTC_WKUP_ALARM_IRQn              = 35,     /*!< RTC Wakeup and Alarm (A & B) interrupt through the EXTI line         */
   TZC_IT_IRQn                      = 36,     /*!< TrustZone DDR address space controller                               */
   RCC_IRQn                         = 37,     /*!< RCC global Interrupt                                                 */
   EXTI0_IRQn                       = 38,     /*!< EXTI Line0 Interrupt                                                 */
   EXTI1_IRQn                       = 39,     /*!< EXTI Line1 Interrupt                                                 */
   EXTI2_IRQn                       = 40,     /*!< EXTI Line2 Interrupt                                                 */
   EXTI3_IRQn                       = 41,     /*!< EXTI Line3 Interrupt                                                 */
   EXTI4_IRQn                       = 42,     /*!< EXTI Line4 Interrupt                                                 */
   DMA1_Stream0_IRQn                = 43,     /*!< DMA1 Stream 0 global Interrupt                                       */
   DMA1_Stream1_IRQn                = 44,     /*!< DMA1 Stream 1 global Interrupt                                       */
   DMA1_Stream2_IRQn                = 45,     /*!< DMA1 Stream 2 global Interrupt                                       */
   DMA1_Stream3_IRQn                = 46,     /*!< DMA1 Stream 3 global Interrupt                                       */
   DMA1_Stream4_IRQn                = 47,     /*!< DMA1 Stream 4 global Interrupt                                       */
   DMA1_Stream5_IRQn                = 48,     /*!< DMA1 Stream 5 global Interrupt                                       */
   DMA1_Stream6_IRQn                = 49,     /*!< DMA1 Stream 6 global Interrupt                                       */
   ADC1_IRQn                        = 50,     /*!< ADC1 global Interrupts                                               */
   ADC2_IRQn                        = 51,     /*!< ADC2 global Interrupts                                               */
   FDCAN1_IT0_IRQn                  = 52,     /*!< FDCAN1 Interrupt line 0                                              */
   FDCAN2_IT0_IRQn                  = 53,     /*!< FDCAN2 Interrupt line 0                                              */
   FDCAN1_IT1_IRQn                  = 54,     /*!< FDCAN1 Interrupt line 1                                              */
   FDCAN2_IT1_IRQn                  = 55,     /*!< FDCAN2 Interrupt line 1                                              */
   EXTI5_IRQn                       = 56,     /*!< External Line[9:5] Interrupts                                        */
   TIM1_BRK_IRQn                    = 57,     /*!< TIM1 Break interrupt                                                 */
   TIM1_UP_IRQn                     = 58,     /*!< TIM1 Update Interrupt                                                */
   TIM1_TRG_COM_IRQn                = 59,     /*!< TIM1 Trigger and Commutation Interrupt                               */
   TIM1_CC_IRQn                     = 60,     /*!< TIM1 Capture Compare Interrupt                                       */
   TIM2_IRQn                        = 61,     /*!< TIM2 global Interrupt                                                */
   TIM3_IRQn                        = 62,     /*!< TIM3 global Interrupt                                                */
   TIM4_IRQn                        = 63,     /*!< TIM4 global Interrupt                                                */
   I2C1_EV_IRQn                     = 64,     /*!< I2C1 Event Interrupt                                                 */
   I2C1_ER_IRQn                     = 65,     /*!< I2C1 Error Interrupt                                                 */
   I2C2_EV_IRQn                     = 66,     /*!< I2C2 Event Interrupt                                                 */
   I2C2_ER_IRQn                     = 67,     /*!< I2C2 Error Interrupt                                                 */
   SPI1_IRQn                        = 68,     /*!< SPI1 global Interrupt                                                */
   SPI2_IRQn                        = 69,     /*!< SPI2 global Interrupt                                                */
   USART1_IRQn                      = 70,     /*!< USART1 global Interrupt                                              */
   USART2_IRQn                      = 71,     /*!< USART2 global Interrupt                                              */
   USART3_IRQn                      = 72,     /*!< USART3 global Interrupt                                              */
   EXTI10_IRQn                      = 73,     /*!< EXTI Line 10 Interrupts                                              */
   RTC_TIMESTAMP_IRQn               = 74,     /*!< RTC TimeStamp through EXTI Line Interrupt                            */
   EXTI11_IRQn                      = 75,     /*!< EXTI Line 11 Interrupts                                              */
   TIM8_BRK_IRQn                    = 76,     /*!< TIM8 Break Interrupt                                                 */
   TIM8_UP_IRQn                     = 77,     /*!< TIM8 Update Interrupt                                                */
   TIM8_TRG_COM_IRQn                = 78,     /*!< TIM8 Trigger and Commutation Interrupt                               */
   TIM8_CC_IRQn                     = 79,     /*!< TIM8 Capture Compare Interrupt                                       */
   DMA1_Stream7_IRQn                = 80,     /*!< DMA1 Stream7 Interrupt                                               */
   FMC_IRQn                         = 81,     /*!< FMC global Interrupt                                                 */
   SDMMC1_IRQn                      = 82,     /*!< SDMMC1 global Interrupt                                              */
   TIM5_IRQn                        = 83,     /*!< TIM5 global Interrupt                                                */
   SPI3_IRQn                        = 84,     /*!< SPI3 global Interrupt                                                */
   UART4_IRQn                       = 85,     /*!< UART4 global Interrupt                                               */
   UART5_IRQn                       = 86,     /*!< UART5 global Interrupt                                               */
   TIM6_IRQn                        = 87,     /*!< TIM6 global                                                          */
   TIM7_IRQn                        = 88,     /*!< TIM7 global interrupt                                                */
   DMA2_Stream0_IRQn                = 89,     /*!< DMA2 Stream 0 global Interrupt                                       */
   DMA2_Stream1_IRQn                = 90,     /*!< DMA2 Stream 1 global Interrupt                                       */
   DMA2_Stream2_IRQn                = 91,     /*!< DMA2 Stream 2 global Interrupt                                       */
   DMA2_Stream3_IRQn                = 92,     /*!< GPDMA2 Stream 3 global Interrupt                                     */
   DMA2_Stream4_IRQn                = 93,     /*!< GPDMA2 Stream 4 global Interrupt                                     */
   ETH1_IRQn                        = 94,     /*!< Ethernet global Interrupt                                            */
   ETH1_WKUP_IRQn                   = 95,     /*!< Ethernet Wakeup through EXTI line Interrupt                          */
   FDCAN_CAL_IRQn                   = 96,     /*!< CAN calibration unit interrupt                                       */
   EXTI6_IRQn                       = 97,     /*!< EXTI Line 6 Interrupts                                               */
   EXTI7_IRQn                       = 98,     /*!< EXTI Line 7 Interrupts                                               */
   EXTI8_IRQn                       = 99,     /*!< EXTI Line 8 Interrupts                                               */
   EXTI9_IRQn                       = 100,    /*!< EXTI Line 9 Interrupts                                               */
   DMA2_Stream5_IRQn                = 101,    /*!< DMA2 Stream 5 global interrupt                                       */
   DMA2_Stream6_IRQn                = 102,    /*!< DMA2 Stream 6 global interrupt                                       */
   DMA2_Stream7_IRQn                = 103,    /*!< DMA2 Stream 7 global interrupt                                       */
   USART6_IRQn                      = 104,    /*!< USART6 global interrupt                                              */
   I2C3_EV_IRQn                     = 105,    /*!< I2C3 event interrupt                                                 */
   I2C3_ER_IRQn                     = 106,    /*!< I2C3 error interrupt                                                 */
   USBH_PORT1_IRQn                  = 107,    /*!< USB Host port 1  Interrupt                                           */
   USBH_PORT2_IRQn                  = 108,    /*!< USB Host port 2  Interrupt                                           */
   EXTI12_IRQn                      = 109,    /*!< EXTI Line 76 Interrupts                                              */
   EXTI13_IRQn                      = 110,    /*!< EXTI Line 77 Interrupts                                              */
   RESERVED_111                     = 111,    /*!< reserved                                                             */
   RESERVED_112                     = 112,    /*!< reserved                                                             */
   HASH1_IRQn                       = 113,    /*!< Hash global interrupt                                                */
   RESERVED_114                     = 114,    /*!< reserved                                                             */
   UART7_IRQn                       = 115,    /*!< UART7 global interrupt                                               */
   UART8_IRQn                       = 116,    /*!< UART8 global interrupt                                               */
   SPI4_IRQn                        = 117,    /*!< SPI4 global Interrupt                                                */
   SPI5_IRQn                        = 118,    /*!< SPI5 global Interrupt                                                */
   SAI1_IRQn                        = 119,    /*!< SAI1 global Interrupt                                                */
   RESERVED_120                     = 120,    /*!< reserved                                                             */
   RESERVED_121                     = 121,    /*!< reserved                                                             */
   SAI2_IRQn                        = 122,    /*!< SAI2 global Interrupt                                                */
   QUADSPI_IRQn                     = 123,    /*!< Quad SPI global interrupt                                            */
   LPTIM1_IRQn                      = 124,    /*!< LP TIM1 interrupt                                                    */
   I2C4_EV_IRQn                     = 125,    /*!< I2C4 Event Interrupt                                                 */
   I2C4_ER_IRQn                     = 126,    /*!< I2C4 Error Interrupt                                                 */
   SPDIF_RX_IRQn                    = 127,    /*!< SPDIF-RX global Interrupt                                            */
   OTG_IRQn                         = 128,    /*!< USB On The Go global interrupt                                       */
   ETH2_IRQn                        = 129,    /*!< Ethernet2 global interrupt                                           */
   ETH2_WKUP_IRQn                   = 130,    /*!< Ethernet2 wkup interrupt (PMT)                                       */
   DMAMUX1_OVR_IRQn                 = 131,    /*!< DMAMUX1 Overrun interrupt                                            */
   DMAMUX2_OVR_IRQn                 = 132,    /*!< DMAMUX2 Overrun interrupt                                            */
   TIM15_IRQn                       = 133,    /*!< TIM15 global Interrupt                                               */
   TIM16_IRQn                       = 134,    /*!< TIM16 global Interrupt                                               */
   TIM17_IRQn                       = 135,    /*!< TIM17 global Interrupt                                               */
   TIM12_IRQn                       = 136,    /*!< TIM12 global Interrupt                                               */
   PKA_IRQn                         = 137,    /*!< PKA global Interrupt                                                 */
   EXTI14_IRQn                      = 138,    /*!< EXTI Line 14 Interrupts                                              */
   MDMA_IRQn                        = 139,    /*!< MDMA global Interrupt                                                */
   SDMMC2_IRQn                      = 140,    /*!< SDMMC2 global Interrupt                                              */
   EXTI15_IRQn                      = 141,    /*!< EXTI Line 15 Interrupts                                              */
   MDMA_SEC_IT_IRQn                 = 142,    /*!< MDMA global Secure interrupt                                         */
   TIM13_IRQn                       = 143,    /*!< TIM13 global interrupt                                               */
   TIM14_IRQn                       = 144,    /*!< TIM14 global interrupt                                               */
   RNG1_IRQn                        = 145,    /*!< RNG1 interrupt                                                       */
   I2C5_EV_IRQn                     = 146,    /*!< I2C5 Event Interrupt                                                 */
   I2C5_ER_IRQn                     = 147,    /*!< I2C5 Error Interrupt                                                 */
   LPTIM2_IRQn                      = 148,    /*!< LP TIM2 global interrupt                                             */
   LPTIM3_IRQn                      = 149,    /*!< LP TIM3 global interrupt                                             */
   LPTIM4_IRQn                      = 150,    /*!< LP TIM4 global interrupt                                             */
   LPTIM5_IRQn                      = 151,    /*!< LP TIM5 global interrupt                                             */
   ETH1_LPI_IRQn                    = 152,    /*!< ETH1_LPI interrupt                                                   */
   ETH2_LPI_IRQn                    = 153,    /*!< ETH2_LPI interrupt                                                   */
   RCC_WAKEUP_IRQn                  = 154,    /*!< RCC Wake up interrupt                                                */
   RESERVED_155                     = 155,    /*!< reserved                                                             */
   DTS_IRQn                         = 156,    /*!< Digital Temperature Sensor Interrupt                                 */
   MPU_WAKEUP_PIN_IRQn              = 157,    /*!< Interrupt for all 6 wake-up enabled by MPU                           */
   IWDG1_IRQn                       = 158,    /*!< IWDG1 Early Interrupt                                                */
   IWDG2_IRQn                       = 159,    /*!< IWDG2 Early Interrupt                                                */
   TAMP_S_IRQn                      = 160,    /*!< TAMP Tamper Secure interrupt                                         */
   RTC_WKUP_ALARM_S_IRQn            = 161,    /*!< RTC Wakeup Timer and Alarms (A and B) Secure interrupt               */
   RTC_TS_S_IRQn                    = 162,    /*!< RTC TimeStamp Secure interrupt                                       */
   RESERVED_163                     = 163,    /*!< reserved                                                             */
   RESERVED_164                     = 164,    /*!< reserved                                                             */
   PMUIRQ0_IRQn                     = 165,    /*!< Cortex-A7 Core#0 Performance Monitor Interrupt                       */
   COMMRX0_IRQn                     = 166,    /*!< Cortex-A7 Core#0 Debug Communication Channel Receive interrupt       */
   COMMTX0_IRQn                     = 167,    /*!< Cortex-A7 Core#0 Debug Communication Channel Transmit interrupt      */
   AXIERRIRQ_IRQn                   = 168,    /*!< Asynchronous AXI Abort interrupt                                     */
   DDRPERFM_IRQn                    = 169,    /*!< DDR Performance Monitor Interrupt                                    */
   nCTIIRQ0_IRQn                    = 170,    /*!< Cortex-A7 Core#0 CTI interrupt                                       */
   RESERVED_171                     = 171,    /*!< reserved                                                             */
   DFSDM1_IRQn                      = 172,    /*!< DFSDM Filter1 Interrupt                                              */
   DFSDM2_IRQn                      = 173,    /*!< DFSDM Filter2 Interrupt                                              */
   DMA3_Stream0_IRQn                = 174,    /*!< DMA3 Stream 0 global Interrupt                                       */
   DMA3_Stream1_IRQn                = 175,    /*!< DMA3 Stream 1 global Interrupt                                       */
   DMA3_Stream2_IRQn                = 176,    /*!< DMA3 Stream 2 global Interrupt                                       */
   DMA3_Stream3_IRQn                = 177,    /*!< DMA3 Stream 3 global Interrupt                                       */
   DMA3_Stream4_IRQn                = 178,    /*!< DMA3 Stream 4 global Interrupt                                       */
   DMA3_Stream5_IRQn                = 179,    /*!< DMA3 Stream 5 global Interrupt                                       */
   DMA3_Stream6_IRQn                = 180,    /*!< DMA3 Stream 6 global Interrupt                                       */
   DMA3_Stream7_IRQn                = 181,    /*!< DMA3 Stream 7 global Interrupt                                       */
   MAX_IRQ_n,
   Force_IRQn_enum_size             = 1048    /* Dummy entry to ensure IRQn_Type is more than 8 bits. Otherwise GIC init loop would fail */
 } IRQn_Type;

/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

#define SDC        /*!< Step Down Converter feature */


/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

