zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
  __IO uint32_t MP_S_AHB4ENSETR;     /*!< RCC secure AHB4 peripheral enable set register             Address offset: 0x768 */
  __IO uint32_t MP_S_AHB4ENCLRR;     /*!< RCC secure AHB4 peripheral enable clear register           Address offset: 0x76C */
  __IO uint32_t MP_NS_AHB4ENSETR;    /*!< RCC non-secure AHB4 peripheral enable set register         Address offset: 0x770 */
  __IO uint32_t MP_NS_AHB4ENCLRR;    /*!< RCC non-secure AHB4 peripheral enable clear register       Address offset: 0x774 */
  __IO uint32_t MP_AHB5ENSETR;       /*!< RCC AHB5 peripheral enable set register                    Address offset: 0x778 */
  __IO uint32_t MP_AHB5ENCLRR;       /*!< RCC AHB5 peripheral enable clear register                  Address offset: 0x77C */
  __IO uint32_t MP_AHB6ENSETR;       /*!< RCC AHB6 peripheral enable set register                    Address offset: 0x780 */
  __IO uint32_t MP_AHB6ENCLRR;       /*!< RCC AHB6 peripheral enable clear register                  Address offset: 0x784 */
  __IO uint32_t MP_S_AHB6ENSETR;     /*!< RCC secure AHB6 peripheral enable set register             Address offset: 0x788 */
  __IO uint32_t MP_S_AHB6ENCLRR;     /*!< RCC secure AHB6 peripheral enable clear register           Address offset: 0x78C */
  __IO uint32_t MP_NS_AHB6ENSETR;    /*!< RCC non-secure AHB6 peripheral enable set register         Address offset: 0x790 */
  __IO uint32_t MP_NS_AHB6ENCLRR;    /*!< RCC non-secure AHB6 peripheral enable clear register       Address offset: 0x794 */
       uint32_t RESERVED20[26];      /*!< Reserved                                                   Address offset: 0x798-0x7FC */
  __IO uint32_t MP_APB1LPENSETR;     /*!< RCC APB1 Sleep clock enable set register                   Address offset: 0x800 */
  __IO uint32_t MP_APB1LPENCLRR;     /*!< RCC APB1 Sleep clock enable clear register                 Address offset: 0x804 */
  __IO uint32_t MP_APB2LPENSETR;     /*!< RCC APB2 Sleep clock enable set register                   Address offset: 0x808 */
  __IO uint32_t MP_APB2LPENCLRR;     /*!< RCC APB2 Sleep clock enable clear register                 Address offset: 0x80C */
  __IO uint32_t MP_APB3LPENSETR;     /*!< RCC APB3 Sleep clock enable set register                   Address offset: 0x810 */
  __IO uint32_t MP_APB3LPENCLRR;     /*!< RCC APB3 Sleep clock enable clear register                 Address offset: 0x814 */
  __IO uint32_t MP_S_APB3LPENSETR;   /*!< RCC secure APB3 Sleep clock enable set register            Address offset: 0x818 */
  __IO uint32_t MP_S_APB3LPENCLRR;   /*!< RCC secure APB3 Sleep clock enable clear register          Address offset: 0x81C */
  __IO uint32_t MP_NS_APB3LPENSETR;  /*!< RCC non-secure APB3 Sleep clock enable set register        Address offset: 0x820 */
  __IO uint32_t MP_NS_APB3LPENCLRR;  /*!< RCC non-secure APB3 Sleep clock enable clear register      Address offset: 0x824 */
  __IO uint32_t MP_APB4LPENSETR;     /*!< RCC APB4 Sleep clock enable set register                   Address offset: 0x828 */
  __IO uint32_t MP_APB4LPENCLRR;     /*!< RCC APB4 Sleep clock enable clear register                 Address offset: 0x82C */
  __IO uint32_t MP_S_APB4LPENSETR;   /*!< RCC secure APB4 sleep peripheral enable set register       Address offset: 0x830 */
  __IO uint32_t MP_S_APB4LPENCLRR;   /*!< RCC secure APB4 sleep peripheral enable clear register     Address offset: 0x834 */
  __IO uint32_t MP_NS_APB4LPENSETR;  /*!< RCC non-secure APB4 sleep peripheral enable set register   Address offset: 0x838 */
  __IO uint32_t MP_NS_APB4LPENCLRR;  /*!< RCC non-secure APB4 sleep peripheral enable clear register Address offset: 0x83C */
  __IO uint32_t MP_APB5LPENSETR;     /*!< RCC APB5 Sleep clock enable set register                   Address offset: 0x840 */
  __IO uint32_t MP_APB5LPENCLRR;     /*!< RCC APB5 Sleep clock enable clear register                 Address offset: 0x844 */
  __IO uint32_t MP_APB6LPENSETR;     /*!< RCC APB6 sleep clock enable set register                   Address offset: 0x848 */
  __IO uint32_t MP_APB6LPENCLRR;     /*!< RCC APB6 sleep clock enable clear register                 Address offset: 0x84C */
  __IO uint32_t MP_AHB2LPENSETR;     /*!< RCC AHB2 Sleep clock enable set register                   Address offset: 0x850 */
  __IO uint32_t MP_AHB2LPENCLRR;     /*!< RCC AHB2 Sleep clock enable clear register                 Address offset: 0x854 */
  __IO uint32_t MP_AHB4LPENSETR;     /*!< RCC AHB4 Sleep clock enable set register                   Address offset: 0x858 */
  __IO uint32_t MP_AHB4LPENCLRR;     /*!< RCC AHB4 Sleep clock enable clear register                 Address offset: 0x85C */
       uint32_t RESERVED21[2];       /*!< Reserved                                                   Address offset: 0x860-0x864 */
  __IO uint32_t MP_S_AHB4LPENSETR;   /*!< RCC secure AHB4 Sleep clock enable set register            Address offset: 0x868 */
  __IO uint32_t MP_S_AHB4LPENCLRR;   /*!< RCC secure AHB4 Sleep clock enable clear register          Address offset: 0x86C */
  __IO uint32_t MP_NS_AHB4LPENSETR;  /*!< RCC non-secure AHB4 Sleep clock enable set register        Address offset: 0x870 */
  __IO uint32_t MP_NS_AHB4LPENCLRR;  /*!< RCC non-secure AHB4 Sleep clock enable clear register      Address offset: 0x874 */
  __IO uint32_t MP_AHB5LPENSETR;     /*!< RCC AHB5 Sleep clock enable set register                   Address offset: 0x878 */
  __IO uint32_t MP_AHB5LPENCLRR;     /*!< RCC AHB5 Sleep clock enable clear register                 Address offset: 0x87C */
  __IO uint32_t MP_AHB6LPENSETR;     /*!< RCC AHB6 Sleep clock enable set register                   Address offset: 0x880 */
  __IO uint32_t MP_AHB6LPENCLRR;     /*!< RCC AHB6 Sleep clock enable clear register                 Address offset: 0x884 */
  __IO uint32_t MP_S_AHB6LPENSETR;   /*!< RCC secure AHB6 Sleep clock enable set register            Address offset: 0x888 */
  __IO uint32_t MP_S_AHB6LPENCLRR;   /*!< RCC secure AHB6 Sleep clock enable clear register          Address offset: 0x88C */
  __IO uint32_t MP_NS_AHB6LPENSETR;  /*!< RCC non-secure AHB6 Sleep clock enable set register        Address offset: 0x890 */
  __IO uint32_t MP_NS_AHB6LPENCLRR;  /*!< RCC non-secure AHB6 Sleep clock enable clear register      Address offset: 0x894 */
  __IO uint32_t MP_S_AXIMLPENSETR;   /*!< RCC secure AXI Sleep clock enable set register             Address offset: 0x898 */
  __IO uint32_t MP_S_AXIMLPENCLRR;   /*!< RCC secure AXI Sleep clock enable clear register           Address offset: 0x89C */
  __IO uint32_t MP_NS_AXIMLPENSETR;  /*!< RCC non-secure AXI Sleep clock enable set register         Address offset: 0x8A0 */
  __IO uint32_t MP_NS_AXIMLPENCLRR;  /*!< RCC non-secure AXI Sleep clock enable clear register       Address offset: 0x8A4 */
  __IO uint32_t MP_MLAHBLPENSETR;    /*!< RCC MLAHB Sleep clock enable set register                  Address offset: 0x8A8 */
  __IO uint32_t MP_MLAHBLPENCLRR;    /*!< RCC MLAHB Sleep clock enable clear register                Address offset: 0x8AC */
       uint32_t RESERVED22[4];       /*!< Reserved                                                   Address offset: 0x8B0-0x8BC */
  __IO uint32_t APB3SECSR;           /*!< RCC APB3 peripheral secure state register                  Address offset: 0x8C0 */
  __IO uint32_t APB4SECSR;           /*!< RCC APB4 peripheral secure state register                  Address offset: 0x8C4 */
  __IO uint32_t APB5SECSR;           /*!< RCC APB5 peripheral secure state register                  Address offset: 0x8C8 */
  __IO uint32_t APB6SECSR;           /*!< RCC APB6 peripheral secure state register                  Address offset: 0x8CC */
  __IO uint32_t AHB2SECSR;           /*!< RCC AHB2 peripheral secure state register                  Address offset: 0x8D0 */
  __IO uint32_t AHB4SECSR;           /*!< RCC AHB4 peripheral secure state register                  Address offset: 0x8D4 */
  __IO uint32_t AHB5SECSR;           /*!< RCC AHB5 peripheral secure state register                  Address offset: 0x8D8 */
  __IO uint32_t AHB6SECSR;           /*!< RCC AHB6 peripheral secure state register                  Address offset: 0x8DC */
       uint32_t RESERVED23[453];     /*!< Reserved                                                   Address offset: 0x8E0-0xFF0 */
  __IO uint32_t VERR;                /*!< RCC Version register                                       Address offset: 0xFF4 */
  __IO uint32_t IDR;                 /*!< RCC ID register                                            Address offset: 0xFF8 */
  __IO uint32_t SIDR;                /*!< RCC Size ID register                                       Address offset: 0xFFC */
} RCC_TypeDef;

/**
  * @brief Hardware Debug Port
  */

typedef struct
{
  __IO uint32_t HDP_CTRL;                  /*!< HDP Control Register,                                Address offset: 0x00 */
  __IO uint32_t HDP_MUX;                   /*!< HDP Multiplexers Control Register,                   Address offset: 0x04 */
       uint32_t RESERVED0[2];              /*!< Reserved, 0x08-0x0C                                  Address offset: 0x08 */
  __IO uint32_t HDP_VAL;                   /*!< HDP Read Back Value Register,                        Address offset: 0x10 */
  __IO uint32_t HDP_GPOSET;                /*!< HDP General Purpose Output Set Register,             Address offset: 0x14 */
  __IO uint32_t HDP_GPOCLR;                /*!< HDP General Purpose Output Clear Register,           Address offset: 0x18 */
  __IO uint32_t HDP_GPOVAL;                /*!< HDP General Purpose Output Value Register,           Address offset: 0x1C */
       uint32_t RESERVED1[245];            /*!< Reserved, 0x20-0x3F4                                 Address offset: 0x20 */
  __IO uint32_t VERR;                  /*!< HDP Version Register,                                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;                 /*!< HDP IP Identification Register,                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;                  /*!< HDP Size Identification register,                    Address offset: 0x3FC */
} HDP_TypeDef;


/**
  * @brief Boot and Security and OTP Control
  */

typedef struct
{
  __IO uint32_t BSEC_OTP_CONFIG;           /*!< BSEC OTP Configuration,                              Address offset: 0x00 */
  __IO uint32_t BSEC_OTP_CONTROL;          /*!< BSEC OTP Control,                                    Address offset: 0x04 */
  __IO uint32_t BSEC_OTP_WRDATA;           /*!< BSEC OTP Write Data,                                 Address offset: 0x08 */
  __IO uint32_t BSEC_OTP_STATUS;           /*!< BSEC OTP Status,                                     Address offset: 0x0C */
  __IO uint32_t BSEC_OTP_LOCK;             /*!< BSEC OTP Configuration,                              Address offset: 0x10 */
  __IO uint32_t BSEC_DENABLE;              /*!< BSEC Debug Configuration,                            Address offset: 0x14 */
  __IO uint32_t RESERVED0x18;              /*!< Reserved,                                            Address offset: 0x18 */
  __IO uint32_t BSEC_OTP_DISTURBED0;       /*!< BSEC OTP Disturbed Status,                           Address offset: 0x1C */
  __IO uint32_t BSEC_OTP_DISTURBED1;       /*!< BSEC OTP Disturbed Status,                           Address offset: 0x20 */
  __IO uint32_t BSEC_OTP_DISTURBED2;       /*!< BSEC OTP Disturbed Status,                           Address offset: 0x24 */
       uint32_t RESERVED0x28;              /*!< Reserved,                                            Address offset: 0x28 */
       uint32_t RESERVED0x2C;              /*!< Reserved,                                            Address offset: 0x2C */
       uint32_t RESERVED0x30;              /*!< Reserved,                                            Address offset: 0x30 */
  __IO uint32_t BSEC_OTP_ERROR0;           /*!< BSEC OTP Error Status,                               Address offset: 0x34 */
  __IO uint32_t BSEC_OTP_ERROR1;           /*!< BSEC OTP Error Status,                               Address offset: 0x38 */
  __IO uint32_t BSEC_OTP_ERROR2;           /*!< BSEC OTP Error Status,                               Address offset: 0x3C */
       uint32_t RESERVED0x40;              /*!< Reserved,                                            Address offset: 0x40 */
       uint32_t RESERVED0x44;              /*!< Reserved,                                            Address offset: 0x44 */
       uint32_t RESERVED0x48;              /*!< Reserved,                                            Address offset: 0x48 */
  __IO uint32_t BSEC_OTP_WRLOCK0;          /*!< BSEC OTP Lock status,                                Address offset: 0x4C */
  __IO uint32_t BSEC_OTP_WRLOCK1;          /*!< BSEC OTP Lock status,                                Address offset: 0x50 */
  __IO uint32_t BSEC_OTP_WRLOCK2;          /*!< BSEC OTP Lock status,                                Address offset: 0x54 */
       uint32_t RESERVED0x58;              /*!< Reserved,                                            Address offset: 0x58 */
       uint32_t RESERVED0x5C;              /*!< Reserved,                                            Address offset: 0x5C */
       uint32_t RESERVED0x60;              /*!< Reserved,                                            Address offset: 0x60 */
  __IO uint32_t BSEC_OTP_SPLOCK0;          /*!< BSEC OTP prg lock under ctrl by stick bits,          Address offset: 0x64 */
  __IO uint32_t BSEC_OTP_SPLOCK1;          /*!< BSEC OTP prg lock under ctrl by stick bits,          Address offset: 0x68 */
  __IO uint32_t BSEC_OTP_SPLOCK2;          /*!< BSEC OTP prg lock under ctrl by stick bits,          Address offset: 0x6C */
       uint32_t RESERVED0x70;              /*!< Reserved,                                            Address offset: 0x70 */
       uint32_t RESERVED0x74;              /*!< Reserved,                                            Address offset: 0x74 */
       uint32_t RESERVED0x78;              /*!< Reserved,                                            Address offset: 0x78 */
  __IO uint32_t BSEC_OTP_SWLOCK0;          /*!< BSEC OTP Shadow Write Lck under ctrl by sticky bits, Address offset: 0x7C */
  __IO uint32_t BSEC_OTP_SWLOCK1;          /*!< BSEC OTP Shadow Write Lck under ctrl by sticky bits, Address offset: 0x80 */
  __IO uint32_t BSEC_OTP_SWLOCK2;          /*!< BSEC OTP Shadow Write Lck under ctrl by sticky bits, Address offset: 0x84 */
       uint32_t RESERVED0x88;              /*!< Reserved,                                            Address offset: 0x88 */
       uint32_t RESERVED0x8C;              /*!< Reserved,                                            Address offset: 0x8C */
       uint32_t RESERVED0x90;              /*!< Reserved,                                            Address offset: 0x90 */
  __IO uint32_t BSEC_OTP_SRLOCK0;          /*!< BSEC OTP Shadow read lock under ctrl by sticky bits, Address offset: 0x94 */
  __IO uint32_t BSEC_OTP_SRLOCK1;          /*!< BSEC OTP Shadow read lock under ctrl by sticky bits, Address offset: 0x98 */
  __IO uint32_t BSEC_OTP_SRLOCK2;          /*!< BSEC OTP Shadow read lock under ctrl by sticky bits, Address offset: 0x9C */
       uint32_t RESERVED0xA0;              /*!< Reserved,                                            Address offset: 0xA0 */
       uint32_t RESERVED0xA4;              /*!< Reserved,                                            Address offset: 0xA4 */
       uint32_t RESERVED0xA8;              /*!< Reserved,                                            Address offset: 0xA8 */
  __IO uint32_t BSEC_JTAGIN;               /*!< BSEC JTAG Input,                                     Address offset: 0xAC */
  __IO uint32_t BSEC_JTAGOUT;              /*!< BSEC JTAG Output,                                    Address offset: 0xB0 */
  __IO uint32_t BSEC_SCRATCH;              /*!< BSEC SCRATCH,                                        Address offset: 0xB4 */
       uint32_t RESERVED0xB8[82];          /*!< Reserved, 0x0B8-0x200                                Address offset: 0xB8 */
  __IO uint32_t BSEC_OTP_DATA[96];         /*!< BSEC Shadow Registers,                               Address offset: 0x200 */
       uint32_t RESERVED0x380[796];        /*!< Reserved, 0x0380-0xFF0                               Address offset: 0x380 */
  __IO uint32_t HWCFGR;                    /*!< BSEC IP HW Configuration Register,                   Address offset: 0xFF0 */
  __IO uint32_t VERR;                      /*!< BSEC IP version Register,                            Address offset: 0xFF4 */
  __IO uint32_t IPIDR;                     /*!< BSEC ID Register,                                    Address offset: 0xFF8 */
  __IO uint32_t SIDR;                      /*!< BSEC SID Register,                                   Address offset: 0xFFC */
} BSEC_TypeDef;


/**
  * @brief RTC Specific device feature definitions
  */
#define RTC_BACKUP_NB       32u /* Backup registers implemented */
#define RTC_TAMP_NB         8u  /* External tamper events (input pins) supported */

/**
  * @brief Real-Time Clock
  */

typedef struct
{
  __IO uint32_t TR;             /*!< RTC time register                                Address offset: 0x000 */
  __IO uint32_t DR;             /*!< RTC date register                                Address offset: 0x004 */
  __IO uint32_t SSR;            /*!< RTC sub second register                          Address offset: 0x008 */
  __IO uint32_t ICSR;           /*!< RTC initialization control and status register   Address offset: 0x00C */
  __IO uint32_t PRER;           /*!< RTC prescaler register                           Address offset: 0x010 */
  __IO uint32_t WUTR;           /*!< RTC wakeup timer register                        Address offset: 0x014 */
  __IO uint32_t CR;             /*!< RTC control register                             Address offset: 0x018 */
  __IO uint32_t PRIVCR;         /*!< RTC privilege mode control register              Address offset: 0x01C */
  __IO uint32_t SECCFGR;        /*!< RTC secure mode control register                 Address offset: 0x020 */
  __IO uint32_t WPR;            /*!< RTC write protection register                    Address offset: 0x024 */
  __IO uint32_t CALR;           /*!< RTC calibration register                         Address offset: 0x028 */
  __IO uint32_t SHIFTR;         /*!< RTC shift control register                       Address offset: 0x02C */
  __IO uint32_t TSTR;           /*!< RTC timestamp time register                      Address offset: 0x030 */
  __IO uint32_t TSDR;           /*!< RTC timestamp date register                      Address offset: 0x034 */
  __IO uint32_t TSSSR;          /*!< RTC timestamp sub second register                Address offset: 0x038 */
       uint32_t RESERVED0;      /*!< Reserved                                         Address offset: 0x03C */
  __IO uint32_t ALRMAR;         /*!< RTC alarm A register                             Address offset: 0x040 */
  __IO uint32_t ALRMASSR;       /*!< RTC alarm A sub second register                  Address offset: 0x044 */
  __IO uint32_t ALRMBR;         /*!< RTC alarm B register                             Address offset: 0x048 */
  __IO uint32_t ALRMBSSR;       /*!< RTC alarm B sub second register                  Address offset: 0x04C */
  __IO uint32_t SR;             /*!< RTC Status register                              Address offset: 0x050 */
  __IO uint32_t MISR;           /*!< RTC non-secure masked interrupt status register  Address offset: 0x054 */
  __IO uint32_t SMISR;          /*!< RTC secure masked interrupt status register      Address offset: 0x058 */
  __IO uint32_t SCR;            /*!< RTC status Clear register                        Address offset: 0x05C */
  __IO uint32_t OR;             /*!< RTC configuration register                       Address offset: 0x060 */
       uint32_t RESERVED1[3];   /*!< Reserved                                         Address offset: 0x064-0x06C */
  __IO uint32_t ALRABINR;       /*!< RTC alarm A binary mode register                 Address offset: 0x070 */
  __IO uint32_t ALRBBINR;       /*!< RTC alarm B binary mode register                 Address offset: 0x074 */
       uint32_t RESERVED2[222];   /*!< Reserved                                       Address offset: 0x078-0x3EC */
  __IO uint32_t HWCFGR;         /*!< RTC hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< RTC version register                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< RTC identification register                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< RTC size identification register                 Address offset: 0x3FC */
} RTC_TypeDef;


