zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
/**************  Bit definition for ETH_MACHT0R register  **************/
#define ETH_MACHT0R_HT31T0_Pos              (0U)
#define ETH_MACHT0R_HT31T0_Msk              (0xFFFFFFFFUL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0xFFFFFFFF */
#define ETH_MACHT0R_HT31T0                  ETH_MACHT0R_HT31T0_Msk                              /*!< MAC Hash Table First 32 Bits */
#define ETH_MACHT0R_HT31T0_0                (0x1UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000001 */
#define ETH_MACHT0R_HT31T0_1                (0x2UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000002 */
#define ETH_MACHT0R_HT31T0_2                (0x4UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000004 */
#define ETH_MACHT0R_HT31T0_3                (0x8UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000008 */
#define ETH_MACHT0R_HT31T0_4                (0x10UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000010 */
#define ETH_MACHT0R_HT31T0_5                (0x20UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000020 */
#define ETH_MACHT0R_HT31T0_6                (0x40UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000040 */
#define ETH_MACHT0R_HT31T0_7                (0x80UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000080 */
#define ETH_MACHT0R_HT31T0_8                (0x100UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000100 */
#define ETH_MACHT0R_HT31T0_9                (0x200UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000200 */
#define ETH_MACHT0R_HT31T0_10               (0x400UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000400 */
#define ETH_MACHT0R_HT31T0_11               (0x800UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000800 */
#define ETH_MACHT0R_HT31T0_12               (0x1000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00001000 */
#define ETH_MACHT0R_HT31T0_13               (0x2000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00002000 */
#define ETH_MACHT0R_HT31T0_14               (0x4000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00004000 */
#define ETH_MACHT0R_HT31T0_15               (0x8000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00008000 */
#define ETH_MACHT0R_HT31T0_16               (0x10000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00010000 */
#define ETH_MACHT0R_HT31T0_17               (0x20000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00020000 */
#define ETH_MACHT0R_HT31T0_18               (0x40000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00040000 */
#define ETH_MACHT0R_HT31T0_19               (0x80000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00080000 */
#define ETH_MACHT0R_HT31T0_20               (0x100000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00100000 */
#define ETH_MACHT0R_HT31T0_21               (0x200000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00200000 */
#define ETH_MACHT0R_HT31T0_22               (0x400000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00400000 */
#define ETH_MACHT0R_HT31T0_23               (0x800000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00800000 */
#define ETH_MACHT0R_HT31T0_24               (0x1000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x01000000 */
#define ETH_MACHT0R_HT31T0_25               (0x2000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x02000000 */
#define ETH_MACHT0R_HT31T0_26               (0x4000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x04000000 */
#define ETH_MACHT0R_HT31T0_27               (0x8000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x08000000 */
#define ETH_MACHT0R_HT31T0_28               (0x10000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x10000000 */
#define ETH_MACHT0R_HT31T0_29               (0x20000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x20000000 */
#define ETH_MACHT0R_HT31T0_30               (0x40000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x40000000 */
#define ETH_MACHT0R_HT31T0_31               (0x80000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x80000000 */

/**************  Bit definition for ETH_MACHT1R register  **************/
#define ETH_MACHT1R_HT63T32_Pos             (0U)
#define ETH_MACHT1R_HT63T32_Msk             (0xFFFFFFFFUL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0xFFFFFFFF */
#define ETH_MACHT1R_HT63T32                 ETH_MACHT1R_HT63T32_Msk                             /*!< MAC Hash Table Second 32 Bits */
#define ETH_MACHT1R_HT63T32_0               (0x1UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000001 */
#define ETH_MACHT1R_HT63T32_1               (0x2UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000002 */
#define ETH_MACHT1R_HT63T32_2               (0x4UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000004 */
#define ETH_MACHT1R_HT63T32_3               (0x8UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000008 */
#define ETH_MACHT1R_HT63T32_4               (0x10UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000010 */
#define ETH_MACHT1R_HT63T32_5               (0x20UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000020 */
#define ETH_MACHT1R_HT63T32_6               (0x40UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000040 */
#define ETH_MACHT1R_HT63T32_7               (0x80UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000080 */
#define ETH_MACHT1R_HT63T32_8               (0x100UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000100 */
#define ETH_MACHT1R_HT63T32_9               (0x200UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000200 */
#define ETH_MACHT1R_HT63T32_10              (0x400UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000400 */
#define ETH_MACHT1R_HT63T32_11              (0x800UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000800 */
#define ETH_MACHT1R_HT63T32_12              (0x1000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00001000 */
#define ETH_MACHT1R_HT63T32_13              (0x2000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00002000 */
#define ETH_MACHT1R_HT63T32_14              (0x4000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00004000 */
#define ETH_MACHT1R_HT63T32_15              (0x8000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00008000 */
#define ETH_MACHT1R_HT63T32_16              (0x10000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00010000 */
#define ETH_MACHT1R_HT63T32_17              (0x20000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00020000 */
#define ETH_MACHT1R_HT63T32_18              (0x40000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00040000 */
#define ETH_MACHT1R_HT63T32_19              (0x80000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00080000 */
#define ETH_MACHT1R_HT63T32_20              (0x100000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00100000 */
#define ETH_MACHT1R_HT63T32_21              (0x200000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00200000 */
#define ETH_MACHT1R_HT63T32_22              (0x400000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00400000 */
#define ETH_MACHT1R_HT63T32_23              (0x800000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00800000 */
#define ETH_MACHT1R_HT63T32_24              (0x1000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x01000000 */
#define ETH_MACHT1R_HT63T32_25              (0x2000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x02000000 */
#define ETH_MACHT1R_HT63T32_26              (0x4000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x04000000 */
#define ETH_MACHT1R_HT63T32_27              (0x8000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x08000000 */
#define ETH_MACHT1R_HT63T32_28              (0x10000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x10000000 */
#define ETH_MACHT1R_HT63T32_29              (0x20000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x20000000 */
#define ETH_MACHT1R_HT63T32_30              (0x40000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x40000000 */
#define ETH_MACHT1R_HT63T32_31              (0x80000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x80000000 */

/**************  Bit definition for ETH_MACVTR register  ***************/
#define ETH_MACVTR_VL_VID_Pos               (0U)
#define ETH_MACVTR_VL_VID_Msk               (0xFFFUL << ETH_MACVTR_VL_VID_Pos)                   /*!< 0x00000FFF */
#define ETH_MACVTR_VL_VID                    ETH_MACVTR_VL_VID_Msk                              /*!< VLAN Tag Identifier field of VLAN tag */
#define ETH_MACVTR_VL_Pos                   (0U)
#define ETH_MACVTR_VL_Msk                   (0xFFFFUL << ETH_MACVTR_VL_Pos)                      /*!< 0x0000FFFF */
#define ETH_MACVTR_VL                        ETH_MACVTR_VL_Msk                                  /*!< VLAN Tag Identifier for Receive Packets */
#define ETH_MACVTR_VL_0                     (0x1UL << ETH_MACVTR_VL_Pos)                         /*!< 0x00000001 */
#define ETH_MACVTR_VL_1                     (0x2UL << ETH_MACVTR_VL_Pos)                         /*!< 0x00000002 */
#define ETH_MACVTR_VL_2                     (0x4UL << ETH_MACVTR_VL_Pos)                         /*!< 0x00000004 */
#define ETH_MACVTR_VL_3                     (0x8UL << ETH_MACVTR_VL_Pos)                         /*!< 0x00000008 */
#define ETH_MACVTR_VL_4                     (0x10UL << ETH_MACVTR_VL_Pos)                        /*!< 0x00000010 */
#define ETH_MACVTR_VL_5                     (0x20UL << ETH_MACVTR_VL_Pos)                        /*!< 0x00000020 */
#define ETH_MACVTR_VL_6                     (0x40UL << ETH_MACVTR_VL_Pos)                        /*!< 0x00000040 */
#define ETH_MACVTR_VL_7                     (0x80UL << ETH_MACVTR_VL_Pos)                        /*!< 0x00000080 */
#define ETH_MACVTR_VL_8                     (0x100UL << ETH_MACVTR_VL_Pos)                       /*!< 0x00000100 */
#define ETH_MACVTR_VL_9                     (0x200UL << ETH_MACVTR_VL_Pos)                       /*!< 0x00000200 */
#define ETH_MACVTR_VL_10                    (0x400UL << ETH_MACVTR_VL_Pos)                       /*!< 0x00000400 */
#define ETH_MACVTR_VL_11                    (0x800UL << ETH_MACVTR_VL_Pos)                       /*!< 0x00000800 */
#define ETH_MACVTR_VL_12                    (0x1000UL << ETH_MACVTR_VL_Pos)                      /*!< 0x00001000 */
#define ETH_MACVTR_VL_13                    (0x2000UL << ETH_MACVTR_VL_Pos)                      /*!< 0x00002000 */
#define ETH_MACVTR_VL_14                    (0x4000UL << ETH_MACVTR_VL_Pos)                      /*!< 0x00004000 */
#define ETH_MACVTR_VL_15                    (0x8000UL << ETH_MACVTR_VL_Pos)                      /*!< 0x00008000 */
#define ETH_MACVTR_ETV_Pos                  (16U)
#define ETH_MACVTR_ETV_Msk                  (0x1UL << ETH_MACVTR_ETV_Pos)                        /*!< 0x00010000 */
#define ETH_MACVTR_ETV                      ETH_MACVTR_ETV_Msk                                  /*!< Enable 12-Bit VLAN Tag Comparison */
#define ETH_MACVTR_VTIM_Pos                 (17U)
#define ETH_MACVTR_VTIM_Msk                 (0x1UL << ETH_MACVTR_VTIM_Pos)                       /*!< 0x00020000 */
#define ETH_MACVTR_VTIM                     ETH_MACVTR_VTIM_Msk                                 /*!< VLAN Tag Inverse Match Enable */
#define ETH_MACVTR_ESVL_Pos                 (18U)
#define ETH_MACVTR_ESVL_Msk                 (0x1UL << ETH_MACVTR_ESVL_Pos)                       /*!< 0x00040000 */
#define ETH_MACVTR_ESVL                     ETH_MACVTR_ESVL_Msk                                 /*!< Enable S-VLAN */
#define ETH_MACVTR_ERSVLM_Pos               (19U)
#define ETH_MACVTR_ERSVLM_Msk               (0x1UL << ETH_MACVTR_ERSVLM_Pos)                     /*!< 0x00080000 */
#define ETH_MACVTR_ERSVLM                   ETH_MACVTR_ERSVLM_Msk                               /*!< Enable Receive S-VLAN Match */
#define ETH_MACVTR_DOVLTC_Pos               (20U)
#define ETH_MACVTR_DOVLTC_Msk               (0x1UL << ETH_MACVTR_DOVLTC_Pos)                     /*!< 0x00100000 */
#define ETH_MACVTR_DOVLTC                   ETH_MACVTR_DOVLTC_Msk                               /*!< Disable VLAN Type Check */
#define ETH_MACVTR_EVLS_Pos                 (21U)
#define ETH_MACVTR_EVLS_Msk                 (0x3UL << ETH_MACVTR_EVLS_Pos)                       /*!< 0x00600000 */
#define ETH_MACVTR_EVLS                     ETH_MACVTR_EVLS_Msk                                 /*!< Enable VLAN Tag Stripping on Receive */
#define ETH_MACVTR_EVLS_DONOTSTRIP          ((uint32_t)0x00000000)                              /* Do not strip */
#define ETH_MACVTR_EVLS_STRIPIFPASS_Pos     (21U)
#define ETH_MACVTR_EVLS_STRIPIFPASS_Msk     (0x1UL << ETH_MACVTR_EVLS_STRIPIFPASS_Pos)          /*!< 0x00200000 */
#define ETH_MACVTR_EVLS_STRIPIFPASS         ETH_MACVTR_EVLS_STRIPIFPASS_Msk                     /* Strip if VLAN filter passes */
#define ETH_MACVTR_EVLS_STRIPIFFAILS_Pos    (22U)
#define ETH_MACVTR_EVLS_STRIPIFFAILS_Msk    (0x1UL << ETH_MACVTR_EVLS_STRIPIFFAILS_Pos)         /*!< 0x00400000 */
#define ETH_MACVTR_EVLS_STRIPIFFAILS        ETH_MACVTR_EVLS_STRIPIFFAILS_Msk                    /* Strip if VLAN filter fails */
#define ETH_MACVTR_EVLS_ALWAYSSTRIP_Pos     (21U)
#define ETH_MACVTR_EVLS_ALWAYSSTRIP_Msk     (0x3UL << ETH_MACVTR_EVLS_ALWAYSSTRIP_Pos)          /*!< 0x00600000 */
#define ETH_MACVTR_EVLS_ALWAYSSTRIP         ETH_MACVTR_EVLS_ALWAYSSTRIP_Msk                     /* Always strip */
#define ETH_MACVTR_EVLRXS_Pos               (24U)
#define ETH_MACVTR_EVLRXS_Msk               (0x1UL << ETH_MACVTR_EVLRXS_Pos)                     /*!< 0x01000000 */
#define ETH_MACVTR_EVLRXS                   ETH_MACVTR_EVLRXS_Msk                               /*!< Enable VLAN Tag in Rx status */
#define ETH_MACVTR_VTHM_Pos                 (25U)
#define ETH_MACVTR_VTHM_Msk                 (0x1UL << ETH_MACVTR_VTHM_Pos)                       /*!< 0x02000000 */
#define ETH_MACVTR_VTHM                     ETH_MACVTR_VTHM_Msk                                 /*!< VLAN Tag Hash Table Match Enable */
#define ETH_MACVTR_EDVLP_Pos                (26U)
#define ETH_MACVTR_EDVLP_Msk                (0x1UL << ETH_MACVTR_EDVLP_Pos)                      /*!< 0x04000000 */
#define ETH_MACVTR_EDVLP                    ETH_MACVTR_EDVLP_Msk                                /*!< Enable Double VLAN Processing */
#define ETH_MACVTR_ERIVLT_Pos               (27U)
#define ETH_MACVTR_ERIVLT_Msk               (0x1UL << ETH_MACVTR_ERIVLT_Pos)                     /*!< 0x08000000 */
#define ETH_MACVTR_ERIVLT                   ETH_MACVTR_ERIVLT_Msk                               /*!< Enable Inner VLAN Tag */
#define ETH_MACVTR_EIVLS_Pos                (28U)
#define ETH_MACVTR_EIVLS_Msk                (0x3UL << ETH_MACVTR_EIVLS_Pos)                      /*!< 0x30000000 */
#define ETH_MACVTR_EIVLS                    ETH_MACVTR_EIVLS_Msk                                /*!< Enable Inner VLAN Tag Stripping on Receive */
#define ETH_MACVTR_EIVLS_DONOTSTRIP         ((uint32_t)0x00000000)                              /* Do not strip */
#define ETH_MACVTR_EIVLS_STRIPIFPASS_Pos    (28U)
#define ETH_MACVTR_EIVLS_STRIPIFPASS_Msk    (0x1UL << ETH_MACVTR_EIVLS_STRIPIFPASS_Pos)         /*!< 0x10000000 */
#define ETH_MACVTR_EIVLS_STRIPIFPASS        ETH_MACVTR_EIVLS_STRIPIFPASS_Msk                    /* Strip if VLAN filter passes */
#define ETH_MACVTR_EIVLS_STRIPIFFAILS_Pos   (29U)
#define ETH_MACVTR_EIVLS_STRIPIFFAILS_Msk   (0x1UL << ETH_MACVTR_EIVLS_STRIPIFFAILS_Pos)        /*!< 0x20000000 */
#define ETH_MACVTR_EIVLS_STRIPIFFAILS       ETH_MACVTR_EIVLS_STRIPIFFAILS_Msk                   /* Strip if VLAN filter fails */
#define ETH_MACVTR_EIVLS_ALWAYSSTRIP_Pos    (28U)
#define ETH_MACVTR_EIVLS_ALWAYSSTRIP_Msk    (0x3UL << ETH_MACVTR_EIVLS_ALWAYSSTRIP_Pos)         /*!< 0x30000000 */
#define ETH_MACVTR_EIVLS_ALWAYSSTRIP        ETH_MACVTR_EIVLS_ALWAYSSTRIP_Msk                   /* Always strip */
#define ETH_MACVTR_EIVLRXS_Pos              (31U)
#define ETH_MACVTR_EIVLRXS_Msk              (0x1UL << ETH_MACVTR_EIVLRXS_Pos)                    /*!< 0x80000000 */
#define ETH_MACVTR_EIVLRXS                  ETH_MACVTR_EIVLRXS_Msk                              /*!< Enable Inner VLAN Tag in Rx Status */

/**************  Bit definition for ETH_MACVHTR register  **************/
#define ETH_MACVHTR_VLHT_Pos                (0U)
#define ETH_MACVHTR_VLHT_Msk                (0xFFFFUL << ETH_MACVHTR_VLHT_Pos)                   /*!< 0x0000FFFF */
#define ETH_MACVHTR_VLHT                    ETH_MACVHTR_VLHT_Msk                                /*!< VLAN Hash Table */
#define ETH_MACVHTR_VLHT_0                  (0x1UL << ETH_MACVHTR_VLHT_Pos)                      /*!< 0x00000001 */
#define ETH_MACVHTR_VLHT_1                  (0x2UL << ETH_MACVHTR_VLHT_Pos)                      /*!< 0x00000002 */
#define ETH_MACVHTR_VLHT_2                  (0x4UL << ETH_MACVHTR_VLHT_Pos)                      /*!< 0x00000004 */
#define ETH_MACVHTR_VLHT_3                  (0x8UL << ETH_MACVHTR_VLHT_Pos)                      /*!< 0x00000008 */
#define ETH_MACVHTR_VLHT_4                  (0x10UL << ETH_MACVHTR_VLHT_Pos)                     /*!< 0x00000010 */
#define ETH_MACVHTR_VLHT_5                  (0x20UL << ETH_MACVHTR_VLHT_Pos)                     /*!< 0x00000020 */
#define ETH_MACVHTR_VLHT_6                  (0x40UL << ETH_MACVHTR_VLHT_Pos)                     /*!< 0x00000040 */
#define ETH_MACVHTR_VLHT_7                  (0x80UL << ETH_MACVHTR_VLHT_Pos)                     /*!< 0x00000080 */
#define ETH_MACVHTR_VLHT_8                  (0x100UL << ETH_MACVHTR_VLHT_Pos)                    /*!< 0x00000100 */
#define ETH_MACVHTR_VLHT_9                  (0x200UL << ETH_MACVHTR_VLHT_Pos)                    /*!< 0x00000200 */
#define ETH_MACVHTR_VLHT_10                 (0x400UL << ETH_MACVHTR_VLHT_Pos)                    /*!< 0x00000400 */
#define ETH_MACVHTR_VLHT_11                 (0x800UL << ETH_MACVHTR_VLHT_Pos)                    /*!< 0x00000800 */
#define ETH_MACVHTR_VLHT_12                 (0x1000UL << ETH_MACVHTR_VLHT_Pos)                   /*!< 0x00001000 */
#define ETH_MACVHTR_VLHT_13                 (0x2000UL << ETH_MACVHTR_VLHT_Pos)                   /*!< 0x00002000 */
#define ETH_MACVHTR_VLHT_14                 (0x4000UL << ETH_MACVHTR_VLHT_Pos)                   /*!< 0x00004000 */
#define ETH_MACVHTR_VLHT_15                 (0x8000UL << ETH_MACVHTR_VLHT_Pos)                   /*!< 0x00008000 */

/**************  Bit definition for ETH_MACVIR register  ***************/
#define ETH_MACVIR_VLT_Pos                  (0U)
#define ETH_MACVIR_VLT_Msk                  (0xFFFFUL << ETH_MACVIR_VLT_Pos)                     /*!< 0x0000FFFF */
#define ETH_MACVIR_VLT                      ETH_MACVIR_VLT_Msk                                  /*!< VLAN Tag for Transmit Packets */
#define ETH_MACVIR_VLT_0                    (0x1UL << ETH_MACVIR_VLT_Pos)                        /*!< 0x00000001 */
#define ETH_MACVIR_VLT_1                    (0x2UL << ETH_MACVIR_VLT_Pos)                        /*!< 0x00000002 */
#define ETH_MACVIR_VLT_2                    (0x4UL << ETH_MACVIR_VLT_Pos)                        /*!< 0x00000004 */
#define ETH_MACVIR_VLT_3                    (0x8UL << ETH_MACVIR_VLT_Pos)                        /*!< 0x00000008 */
#define ETH_MACVIR_VLT_4                    (0x10UL << ETH_MACVIR_VLT_Pos)                       /*!< 0x00000010 */
#define ETH_MACVIR_VLT_5                    (0x20UL << ETH_MACVIR_VLT_Pos)                       /*!< 0x00000020 */
#define ETH_MACVIR_VLT_6                    (0x40UL << ETH_MACVIR_VLT_Pos)                       /*!< 0x00000040 */
#define ETH_MACVIR_VLT_7                    (0x80UL << ETH_MACVIR_VLT_Pos)                       /*!< 0x00000080 */
#define ETH_MACVIR_VLT_8                    (0x100UL << ETH_MACVIR_VLT_Pos)                      /*!< 0x00000100 */
#define ETH_MACVIR_VLT_9                    (0x200UL << ETH_MACVIR_VLT_Pos)                      /*!< 0x00000200 */
#define ETH_MACVIR_VLT_10                   (0x400UL << ETH_MACVIR_VLT_Pos)                      /*!< 0x00000400 */
#define ETH_MACVIR_VLT_11                   (0x800UL << ETH_MACVIR_VLT_Pos)                      /*!< 0x00000800 */
#define ETH_MACVIR_VLT_12                   (0x1000UL << ETH_MACVIR_VLT_Pos)                     /*!< 0x00001000 */
#define ETH_MACVIR_VLT_13                   (0x2000UL << ETH_MACVIR_VLT_Pos)                     /*!< 0x00002000 */
#define ETH_MACVIR_VLT_14                   (0x4000UL << ETH_MACVIR_VLT_Pos)                     /*!< 0x00004000 */
#define ETH_MACVIR_VLT_15                   (0x8000UL << ETH_MACVIR_VLT_Pos)                     /*!< 0x00008000 */
#define ETH_MACVIR_VLC_Pos                  (16U)
#define ETH_MACVIR_VLC_Msk                  (0x3UL << ETH_MACVIR_VLC_Pos)                        /*!< 0x00030000 */
#define ETH_MACVIR_VLC                      ETH_MACVIR_VLC_Msk                                  /*!< VLAN Tag Control in Transmit Packets */
#define ETH_MACVIR_VLC_NOVLANTAG            ((uint32_t)0x00000000)                              /* No VLAN tag deletion, insertion, or replacement */
#define ETH_MACVIR_VLC_VLANTAGDELETE_Pos    (16U)
#define ETH_MACVIR_VLC_VLANTAGDELETE_Msk    (0x1UL << ETH_MACVIR_VLC_VLANTAGDELETE_Pos)         /*!< 0x00010000 */
#define ETH_MACVIR_VLC_VLANTAGDELETE        ETH_MACVIR_VLC_VLANTAGDELETE_Msk                    /* VLAN tag deletion */
#define ETH_MACVIR_VLC_VLANTAGINSERT_Pos    (17U)
#define ETH_MACVIR_VLC_VLANTAGINSERT_Msk    (0x1UL << ETH_MACVIR_VLC_VLANTAGINSERT_Pos)         /*!< 0x00020000 */
#define ETH_MACVIR_VLC_VLANTAGINSERT        ETH_MACVIR_VLC_VLANTAGINSERT_Msk                    /* VLAN tag insertion */
#define ETH_MACVIR_VLC_VLANTAGREPLACE_Pos   (16U)
#define ETH_MACVIR_VLC_VLANTAGREPLACE_Msk   (0x3UL << ETH_MACVIR_VLC_VLANTAGREPLACE_Pos)        /*!< 0x00030000 */
#define ETH_MACVIR_VLC_VLANTAGREPLACE       ETH_MACVIR_VLC_VLANTAGREPLACE_Msk                   /* VLAN tag replacement */
#define ETH_MACVIR_VLP_Pos                  (18U)
#define ETH_MACVIR_VLP_Msk                  (0x1UL << ETH_MACVIR_VLP_Pos)                        /*!< 0x00040000 */
#define ETH_MACVIR_VLP                      ETH_MACVIR_VLP_Msk                                  /*!< VLAN Priority Control */
#define ETH_MACVIR_CSVL_Pos                 (19U)
#define ETH_MACVIR_CSVL_Msk                 (0x1UL << ETH_MACVIR_CSVL_Pos)                       /*!< 0x00080000 */
#define ETH_MACVIR_CSVL                     ETH_MACVIR_CSVL_Msk                                 /*!< C-VLAN or S-VLAN */
#define ETH_MACVIR_VLTI_Pos                 (20U)
#define ETH_MACVIR_VLTI_Msk                 (0x1UL << ETH_MACVIR_VLTI_Pos)                       /*!< 0x00100000 */
#define ETH_MACVIR_VLTI                     ETH_MACVIR_VLTI_Msk                                 /*!< VLAN Tag Input */

