zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
/******************  Bit definition for FMC_PCSCNTR register  *****************/
#define FMC_PCSCNTR_CSCOUNT_Pos        (0U)
#define FMC_PCSCNTR_CSCOUNT_Msk        (0xFFFFUL << FMC_PCSCNTR_CSCOUNT_Pos)    /*!< 0x0000FFFF */
#define FMC_PCSCNTR_CSCOUNT            FMC_PCSCNTR_CSCOUNT_Msk                 /*!<CSCOUNT[15:0] bits Chip Select (CS) counter */

#define FMC_PCSCNTR_CNTB1EN_Pos        (16U)
#define FMC_PCSCNTR_CNTB1EN_Msk        (0x1UL << FMC_PCSCNTR_CNTB1EN_Pos)       /*!< 0x00010000 */
#define FMC_PCSCNTR_CNTB1EN            FMC_PCSCNTR_CNTB1EN_Msk                 /*!<CNTB1EN bit Counter Bank1 enable */

#define FMC_PCSCNTR_CNTB2EN_Pos        (17U)
#define FMC_PCSCNTR_CNTB2EN_Msk        (0x1UL << FMC_PCSCNTR_CNTB2EN_Pos)       /*!< 0x00020000 */
#define FMC_PCSCNTR_CNTB2EN            FMC_PCSCNTR_CNTB2EN_Msk                 /*!<CNTB2EN bit Counter Bank2 enable */

#define FMC_PCSCNTR_CNTB3EN_Pos        (18U)
#define FMC_PCSCNTR_CNTB3EN_Msk        (0x1UL << FMC_PCSCNTR_CNTB3EN_Pos)       /*!< 0x00040000 */
#define FMC_PCSCNTR_CNTB3EN            FMC_PCSCNTR_CNTB3EN_Msk                 /*!<CNTB3EN bit Counter Bank3 enable */

#define FMC_PCSCNTR_CNTB4EN_Pos        (19U)
#define FMC_PCSCNTR_CNTB4EN_Msk        (0x1UL << FMC_PCSCNTR_CNTB4EN_Pos)       /*!< 0x00080000 */
#define FMC_PCSCNTR_CNTB4EN            FMC_PCSCNTR_CNTB4EN_Msk                 /*!<CNTB4EN bit Counter Bank4 enable */

/*****************  Bit definition for FMC_PCR register  ******************/
#define FMC_PCR_PWAITEN_Pos           (1U)
#define FMC_PCR_PWAITEN_Msk           (0x1U << FMC_PCR_PWAITEN_Pos)          /*!< 0x00000002 */
#define FMC_PCR_PWAITEN               FMC_PCR_PWAITEN_Msk                    /*!< Wait feature enable bit */
#define FMC_PCR_PBKEN_Pos             (2U)
#define FMC_PCR_PBKEN_Msk             (0x1U << FMC_PCR_PBKEN_Pos)            /*!< 0x00000004 */
#define FMC_PCR_PBKEN                 FMC_PCR_PBKEN_Msk                      /*!< NAND Flash memory bank enable bit */
#define FMC_PCR_PWID_Pos              (4U)
#define FMC_PCR_PWID_Msk              (0x3U << FMC_PCR_PWID_Pos)             /*!< 0x00000030 */
#define FMC_PCR_PWID                  FMC_PCR_PWID_Msk                       /*!< Data bus width */
#define FMC_PCR_ECCEN_Pos             (6U)
#define FMC_PCR_ECCEN_Msk             (0x1U << FMC_PCR_ECCEN_Pos)            /*!< 0x00000040 */
#define FMC_PCR_ECCEN                 FMC_PCR_ECCEN_Msk                      /*!< ECC computation logic enable bit */
#define FMC_PCR_ECCALG_Pos            (8U)
#define FMC_PCR_ECCALG_Msk            (0x1U << FMC_PCR_ECCALG_Pos)           /*!< 0x00000100 */
#define FMC_PCR_ECCALG                FMC_PCR_ECCALG_Msk                     /*!< ECC algorithm */
#define FMC_PCR_TCLR_Pos              (9U)
#define FMC_PCR_TCLR_Msk              (0xFU << FMC_PCR_TCLR_Pos)             /*!< 0x00001E00 */
#define FMC_PCR_TCLR                  FMC_PCR_TCLR_Msk                       /*!< CLE to RE delay. */
#define FMC_PCR_TAR_Pos               (13U)
#define FMC_PCR_TAR_Msk               (0xFU << FMC_PCR_TAR_Pos)              /*!< 0x0001E000 */
#define FMC_PCR_TAR                   FMC_PCR_TAR_Msk                        /*!< ALE to RE delay. */
#define FMC_PCR_ECCSS_Pos             (17U)
#define FMC_PCR_ECCSS_Msk             (0x7U << FMC_PCR_ECCSS_Pos)            /*!< 0x000E0000 */
#define FMC_PCR_ECCSS                 FMC_PCR_ECCSS_Msk                      /*!< ECC sector size (used to access spare area) */
#define FMC_PCR_TCEH_Pos              (20U)
#define FMC_PCR_TCEH_Msk              (0xFU << FMC_PCR_TCEH_Pos)             /*!< 0x00F00000 */
#define FMC_PCR_TCEH                  FMC_PCR_TCEH_Msk                       /*!< Chip select high timing */
#define FMC_PCR_BCHECC_Pos            (24U)
#define FMC_PCR_BCHECC_Msk            (0x1U << FMC_PCR_BCHECC_Pos)           /*!< 0x01000000 */
#define FMC_PCR_BCHECC                FMC_PCR_BCHECC_Msk                     /*!< BCH error correction capability */
#define FMC_PCR_WEN_Pos               (25U)
#define FMC_PCR_WEN_Msk               (0x1U << FMC_PCR_WEN_Pos)              /*!< 0x02000000 */
#define FMC_PCR_WEN                   FMC_PCR_WEN_Msk                        /*!< Write enable */

/******************  Bit definition for FMC_SR register  ******************/
#define FMC_SR_ISOST_Pos              (0U)
#define FMC_SR_ISOST_Msk              (0x3U << FMC_SR_ISOST_Pos)             /*!< 0x00000003 */
#define FMC_SR_ISOST                  FMC_SR_ISOST_Msk                       /*!< FMC isolation state with respect to the AXI interface */
#define FMC_SR_PEF_Pos                (4U)
#define FMC_SR_PEF_Msk                (0x1U << FMC_SR_PEF_Pos)               /*!< 0x00000010 */
#define FMC_SR_PEF                    FMC_SR_PEF_Msk                         /*!< Pipe Empty Flag */
#define FMC_SR_NWRF_Pos               (6U)
#define FMC_SR_NWRF_Msk               (0x1U << FMC_SR_NWRF_Pos)              /*!< 0x00000040 */
#define FMC_SR_NWRF                   FMC_SR_NWRF_Msk                        /*!< NAND write request flag */

/*****************  Bit definition for FMC_PMEM register  *****************/
#define FMC_PMEM_MEMSET_Pos           (0U)
#define FMC_PMEM_MEMSET_Msk           (0xFFU << FMC_PMEM_MEMSET_Pos)         /*!< 0x000000FF */
#define FMC_PMEM_MEMSET               FMC_PMEM_MEMSET_Msk                    /*!< Common memory setup time */
#define FMC_PMEM_MEMWAIT_Pos          (8U)
#define FMC_PMEM_MEMWAIT_Msk          (0xFFU << FMC_PMEM_MEMWAIT_Pos)        /*!< 0x0000FF00 */
#define FMC_PMEM_MEMWAIT              FMC_PMEM_MEMWAIT_Msk                   /*!< Common memory wait time */
#define FMC_PMEM_MEMHOLD_Pos          (16U)
#define FMC_PMEM_MEMHOLD_Msk          (0xFFU << FMC_PMEM_MEMHOLD_Pos)        /*!< 0x00FF0000 */
#define FMC_PMEM_MEMHOLD              FMC_PMEM_MEMHOLD_Msk                   /*!< Common memory hold time */
#define FMC_PMEM_MEMHIZ_Pos           (24U)
#define FMC_PMEM_MEMHIZ_Msk           (0xFFU << FMC_PMEM_MEMHIZ_Pos)         /*!< 0xFF000000 */
#define FMC_PMEM_MEMHIZ               FMC_PMEM_MEMHIZ_Msk                    /*!< Common memory data bus Hi-Z time */

/*****************  Bit definition for FMC_PATT register  *****************/
#define FMC_PATT_ATTSET_Pos           (0U)
#define FMC_PATT_ATTSET_Msk           (0xFFU << FMC_PATT_ATTSET_Pos)         /*!< 0x000000FF */
#define FMC_PATT_ATTSET               FMC_PATT_ATTSET_Msk                    /*!< Attribute memory setup time */
#define FMC_PATT_ATTWAIT_Pos          (8U)
#define FMC_PATT_ATTWAIT_Msk          (0xFFU << FMC_PATT_ATTWAIT_Pos)        /*!< 0x0000FF00 */
#define FMC_PATT_ATTWAIT              FMC_PATT_ATTWAIT_Msk                   /*!< Attribute memory wait time */
#define FMC_PATT_ATTHOLD_Pos          (16U)
#define FMC_PATT_ATTHOLD_Msk          (0xFFU << FMC_PATT_ATTHOLD_Pos)        /*!< 0x00FF0000 */
#define FMC_PATT_ATTHOLD              FMC_PATT_ATTHOLD_Msk                   /*!< Attribute memory hold time */
#define FMC_PATT_ATTHIZ_Pos           (24U)
#define FMC_PATT_ATTHIZ_Msk           (0xFFU << FMC_PATT_ATTHIZ_Pos)         /*!< 0xFF000000 */
#define FMC_PATT_ATTHIZ               FMC_PATT_ATTHIZ_Msk                    /*!< Attribute memory data bus Hi-Z time */

/*****************  Bit definition for FMC_HPR register  ******************/
#define FMC_HPR_HPR_Pos               (0U)
#define FMC_HPR_HPR_Msk               (0xFFFFFFFFU << FMC_HPR_HPR_Pos)       /*!< 0xFFFFFFFF */
#define FMC_HPR_HPR                   FMC_HPR_HPR_Msk                        /*!< Hamming parity result */

