zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
/****************  Bit definition for RCC_PLL4CFGR2 register  *****************/
#define RCC_PLL4CFGR2_DIVP_Pos                     (0U)
#define RCC_PLL4CFGR2_DIVP_Msk                     (0x7FUL << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x0000007F */
#define RCC_PLL4CFGR2_DIVP                         RCC_PLL4CFGR2_DIVP_Msk                              /*!< PLL4 DIVP division factor Written by software to control the frequency of the pll4_p_ck clock. ... */
#define RCC_PLL4CFGR2_DIVP_0                       (0x1UL << RCC_PLL4CFGR2_DIVP_Pos)                    /*!< 0x00000001 */
#define RCC_PLL4CFGR2_DIVP_1                       (0x2UL << RCC_PLL4CFGR2_DIVP_Pos)                    /*!< 0x00000002 */
#define RCC_PLL4CFGR2_DIVP_2                       (0x4UL << RCC_PLL4CFGR2_DIVP_Pos)                    /*!< 0x00000004 */
#define RCC_PLL4CFGR2_DIVP_3                       (0x8UL << RCC_PLL4CFGR2_DIVP_Pos)                    /*!< 0x00000008 */
#define RCC_PLL4CFGR2_DIVP_4                       (0x10UL << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000010 */
#define RCC_PLL4CFGR2_DIVP_5                       (0x20UL << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000020 */
#define RCC_PLL4CFGR2_DIVP_6                       (0x40UL << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000040 */
#define RCC_PLL4CFGR2_DIVQ_Pos                     (8U)
#define RCC_PLL4CFGR2_DIVQ_Msk                     (0x7FUL << RCC_PLL4CFGR2_DIVQ_Pos)                   /*!< 0x00007F00 */
#define RCC_PLL4CFGR2_DIVQ                         RCC_PLL4CFGR2_DIVQ_Msk                              /*!< PLL4 DIVQ division factor Written by software to control the frequency of the pll4_q_ck clock. ... */
#define RCC_PLL4CFGR2_DIVQ_0                       (0x1UL << RCC_PLL4CFGR2_DIVQ_Pos)                  /*!< 0x00000100 */
#define RCC_PLL4CFGR2_DIVQ_1                       (0x2UL << RCC_PLL4CFGR2_DIVQ_Pos)                  /*!< 0x00000200 */
#define RCC_PLL4CFGR2_DIVQ_2                       (0x4UL << RCC_PLL4CFGR2_DIVQ_Pos)                  /*!< 0x00000400 */
#define RCC_PLL4CFGR2_DIVQ_3                       (0x8UL << RCC_PLL4CFGR2_DIVQ_Pos)                  /*!< 0x00000800 */
#define RCC_PLL4CFGR2_DIVQ_4                       (0x10UL << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00001000 */
#define RCC_PLL4CFGR2_DIVQ_5                       (0x20UL << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00002000 */
#define RCC_PLL4CFGR2_DIVQ_6                       (0x40UL << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00004000 */
#define RCC_PLL4CFGR2_DIVR_Pos                     (16U)
#define RCC_PLL4CFGR2_DIVR_Msk                     (0x7FUL << RCC_PLL4CFGR2_DIVR_Pos)                   /*!< 0x007F0000 */
#define RCC_PLL4CFGR2_DIVR                         RCC_PLL4CFGR2_DIVR_Msk                              /*!< PLL4 DIVR division factor Written by software to control the frequency of the pll4_r_ck clock. ... */
#define RCC_PLL4CFGR2_DIVR_0                       (0x1UL << RCC_PLL4CFGR2_DIVR_Pos)                /*!< 0x00010000 */
#define RCC_PLL4CFGR2_DIVR_1                       (0x2UL << RCC_PLL4CFGR2_DIVR_Pos)                /*!< 0x00020000 */
#define RCC_PLL4CFGR2_DIVR_2                       (0x4UL << RCC_PLL4CFGR2_DIVR_Pos)                /*!< 0x00040000 */
#define RCC_PLL4CFGR2_DIVR_3                       (0x8UL << RCC_PLL4CFGR2_DIVR_Pos)                /*!< 0x00080000 */
#define RCC_PLL4CFGR2_DIVR_4                       (0x10UL << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00100000 */
#define RCC_PLL4CFGR2_DIVR_5                       (0x20UL << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00200000 */
#define RCC_PLL4CFGR2_DIVR_6                       (0x40UL << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00400000 */

/****************  Bit definition for RCC_PLL4FRACR register  *****************/
#define RCC_PLL4FRACR_FRACV_Pos                    (3U)
#define RCC_PLL4FRACR_FRACV_Msk                    (0x1FFFUL << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x0000FFF8 */
#define RCC_PLL4FRACR_FRACV                        RCC_PLL4FRACR_FRACV_Msk                             /*!< Fractional part of the multiplication factor for PLL4 VCO Written by software to control the fractional part of the multiplication factor of the VCO. These bits can be written at any time, allowing dynamic fine-tuning of the PLL4 VCO. Warning: the software has to set correctly these bits to ensure that the VCO output frequency is between its valid frequency range, which is between 400 and 800 MHz. VCO output frequency = Fref4_ck x ((DIVN+1) + (FRACV / 8192)), with - DIVN shall be between 4 and 512 - FRACV can be between 0 and 8191 - The input frequency Fref4_ck shall be between 1 and 16 MHz In order to change the FRACV value on-the-fly even if the PLL is enabled, the application has to proceed as follow: - set the bit FRACLE to '0', - write the new fractional value into FRACV, - set the bit FRACLE to '1'. */
#define RCC_PLL4FRACR_FRACV_0                      (0x1UL << RCC_PLL4FRACR_FRACV_Pos)                   /*!< 0x00000008 */
#define RCC_PLL4FRACR_FRACV_1                      (0x2UL << RCC_PLL4FRACR_FRACV_Pos)                  /*!< 0x00000010 */
#define RCC_PLL4FRACR_FRACV_2                      (0x4UL << RCC_PLL4FRACR_FRACV_Pos)                  /*!< 0x00000020 */
#define RCC_PLL4FRACR_FRACV_3                      (0x8UL << RCC_PLL4FRACR_FRACV_Pos)                  /*!< 0x00000040 */
#define RCC_PLL4FRACR_FRACV_4                      (0x10UL << RCC_PLL4FRACR_FRACV_Pos)                  /*!< 0x00000080 */
#define RCC_PLL4FRACR_FRACV_5                      (0x20UL << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000100 */
#define RCC_PLL4FRACR_FRACV_6                      (0x40UL << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000200 */
#define RCC_PLL4FRACR_FRACV_7                      (0x80UL << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000400 */
#define RCC_PLL4FRACR_FRACV_8                      (0x100UL << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000800 */
#define RCC_PLL4FRACR_FRACV_9                      (0x200UL << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00001000 */
#define RCC_PLL4FRACR_FRACV_10                     (0x400UL << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00002000 */
#define RCC_PLL4FRACR_FRACV_11                     (0x800UL << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00004000 */
#define RCC_PLL4FRACR_FRACV_12                     (0x1000UL << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00008000 */
#define RCC_PLL4FRACR_FRACLE_Pos                   (16U)
#define RCC_PLL4FRACR_FRACLE_Msk                   (0x1UL << RCC_PLL4FRACR_FRACLE_Pos)                  /*!< 0x00010000 */
#define RCC_PLL4FRACR_FRACLE                       RCC_PLL4FRACR_FRACLE_Msk                            /*!< PLL4 fractional latch enable Set and reset by software to latch the content of FRACV into the Sigma-Delta modulator. In order to latch the FRACV value into the Sigma-Delta modulator, FRACLE must be set to '0', then set to '1': the transition 0 to '1' transfers the content of FRACV into the modulator. Refer to Section: Refer to and dividers for additional information. */

/*****************  Bit definition for RCC_PLL4CSGR register  *****************/
#define RCC_PLL4CSGR_MOD_PER_Pos                   (0U)
#define RCC_PLL4CSGR_MOD_PER_Msk                   (0x1FFFUL << RCC_PLL4CSGR_MOD_PER_Pos)               /*!< 0x00001FFF */
#define RCC_PLL4CSGR_MOD_PER                       RCC_PLL4CSGR_MOD_PER_Msk                            /*!< Modulation Period Adjustment for PLL4 Written by software to adjust the modulation period of the clock spreading generator. */
#define RCC_PLL4CSGR_MOD_PER_0                     (0x1UL << RCC_PLL4CSGR_MOD_PER_Pos)                  /*!< 0x00000001 */
#define RCC_PLL4CSGR_MOD_PER_1                     (0x2UL << RCC_PLL4CSGR_MOD_PER_Pos)                  /*!< 0x00000002 */
#define RCC_PLL4CSGR_MOD_PER_2                     (0x4UL << RCC_PLL4CSGR_MOD_PER_Pos)                  /*!< 0x00000004 */
#define RCC_PLL4CSGR_MOD_PER_3                     (0x8UL << RCC_PLL4CSGR_MOD_PER_Pos)                  /*!< 0x00000008 */
#define RCC_PLL4CSGR_MOD_PER_4                     (0x10UL << RCC_PLL4CSGR_MOD_PER_Pos)                 /*!< 0x00000010 */
#define RCC_PLL4CSGR_MOD_PER_5                     (0x20UL << RCC_PLL4CSGR_MOD_PER_Pos)                 /*!< 0x00000020 */
#define RCC_PLL4CSGR_MOD_PER_6                     (0x40UL << RCC_PLL4CSGR_MOD_PER_Pos)                 /*!< 0x00000040 */
#define RCC_PLL4CSGR_MOD_PER_7                     (0x80UL << RCC_PLL4CSGR_MOD_PER_Pos)                 /*!< 0x00000080 */
#define RCC_PLL4CSGR_MOD_PER_8                     (0x100UL << RCC_PLL4CSGR_MOD_PER_Pos)                /*!< 0x00000100 */
#define RCC_PLL4CSGR_MOD_PER_9                     (0x200UL << RCC_PLL4CSGR_MOD_PER_Pos)                /*!< 0x00000200 */
#define RCC_PLL4CSGR_MOD_PER_10                    (0x400UL << RCC_PLL4CSGR_MOD_PER_Pos)                /*!< 0x00000400 */
#define RCC_PLL4CSGR_MOD_PER_11                    (0x800UL << RCC_PLL4CSGR_MOD_PER_Pos)                /*!< 0x00000800 */
#define RCC_PLL4CSGR_MOD_PER_12                    (0x1000UL << RCC_PLL4CSGR_MOD_PER_Pos)               /*!< 0x00001000 */
#define RCC_PLL4CSGR_TPDFN_DIS_Pos                 (13U)
#define RCC_PLL4CSGR_TPDFN_DIS_Msk                 (0x1UL << RCC_PLL4CSGR_TPDFN_DIS_Pos)                /*!< 0x00002000 */
#define RCC_PLL4CSGR_TPDFN_DIS                     RCC_PLL4CSGR_TPDFN_DIS_Msk                          /*!< Dithering TPDF noise control Set and reset by software. This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function. */
#define RCC_PLL4CSGR_RPDFN_DIS_Pos                 (14U)
#define RCC_PLL4CSGR_RPDFN_DIS_Msk                 (0x1UL << RCC_PLL4CSGR_RPDFN_DIS_Pos)                /*!< 0x00004000 */
#define RCC_PLL4CSGR_RPDFN_DIS                     RCC_PLL4CSGR_RPDFN_DIS_Msk                          /*!< Dithering RPDF noise control Set and reset by software. This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function. */
#define RCC_PLL4CSGR_SSCG_MODE_Pos                 (15U)
#define RCC_PLL4CSGR_SSCG_MODE_Msk                 (0x1UL << RCC_PLL4CSGR_SSCG_MODE_Pos)                /*!< 0x00008000 */
#define RCC_PLL4CSGR_SSCG_MODE                     RCC_PLL4CSGR_SSCG_MODE_Msk                          /*!< Spread spectrum clock generator mode Set and reset by software to select the clock spreading mode. */
#define RCC_PLL4CSGR_INC_STEP_Pos                  (16U)
#define RCC_PLL4CSGR_INC_STEP_Msk                  (0x7FFFUL << RCC_PLL4CSGR_INC_STEP_Pos)              /*!< 0x7FFF0000 */
#define RCC_PLL4CSGR_INC_STEP                      RCC_PLL4CSGR_INC_STEP_Msk                           /*!< Modulation Depth Adjustment for PLL4 Written by software to adjust the modulation depth of the clock spreading generator. */
#define RCC_PLL4CSGR_INC_STEP_0                    (0x1UL << RCC_PLL4CSGR_INC_STEP_Pos)             /*!< 0x00010000 */
#define RCC_PLL4CSGR_INC_STEP_1                    (0x2UL << RCC_PLL4CSGR_INC_STEP_Pos)             /*!< 0x00020000 */
#define RCC_PLL4CSGR_INC_STEP_2                    (0x4UL << RCC_PLL4CSGR_INC_STEP_Pos)             /*!< 0x00040000 */
#define RCC_PLL4CSGR_INC_STEP_3                    (0x8UL << RCC_PLL4CSGR_INC_STEP_Pos)             /*!< 0x00080000 */
#define RCC_PLL4CSGR_INC_STEP_4                    (0x10UL << RCC_PLL4CSGR_INC_STEP_Pos)            /*!< 0x00100000 */
#define RCC_PLL4CSGR_INC_STEP_5                    (0x20UL << RCC_PLL4CSGR_INC_STEP_Pos)            /*!< 0x00200000 */
#define RCC_PLL4CSGR_INC_STEP_6                    (0x40UL << RCC_PLL4CSGR_INC_STEP_Pos)            /*!< 0x00400000 */
#define RCC_PLL4CSGR_INC_STEP_7                    (0x80UL << RCC_PLL4CSGR_INC_STEP_Pos)            /*!< 0x00800000 */
#define RCC_PLL4CSGR_INC_STEP_8                    (0x100UL << RCC_PLL4CSGR_INC_STEP_Pos)           /*!< 0x01000000 */
#define RCC_PLL4CSGR_INC_STEP_9                    (0x200UL << RCC_PLL4CSGR_INC_STEP_Pos)           /*!< 0x02000000 */
#define RCC_PLL4CSGR_INC_STEP_10                   (0x400UL << RCC_PLL4CSGR_INC_STEP_Pos)           /*!< 0x04000000 */
#define RCC_PLL4CSGR_INC_STEP_11                   (0x800UL << RCC_PLL4CSGR_INC_STEP_Pos)           /*!< 0x08000000 */
#define RCC_PLL4CSGR_INC_STEP_12                   (0x1000UL << RCC_PLL4CSGR_INC_STEP_Pos)          /*!< 0x10000000 */
#define RCC_PLL4CSGR_INC_STEP_13                   (0x2000UL << RCC_PLL4CSGR_INC_STEP_Pos)          /*!< 0x20000000 */
#define RCC_PLL4CSGR_INC_STEP_14                   (0x4000UL << RCC_PLL4CSGR_INC_STEP_Pos)          /*!< 0x40000000 */

/*****************  Bit definition for RCC_MPCKSELR register  *****************/
#define RCC_MPCKSELR_MPUSRC_Pos                    (0U)
#define RCC_MPCKSELR_MPUSRC_Msk                    (0x3UL << RCC_MPCKSELR_MPUSRC_Pos)                   /*!< 0x00000003 */
#define RCC_MPCKSELR_MPUSRC                        RCC_MPCKSELR_MPUSRC_Msk                             /*!< MPU clock switch Written by software to select the MPU sub-system clock source (mpuss_ck). Note that MPUDIV is disabled if MPUSRC[1:0] is different from '11'. Be sure that MPUDIV is different from '000' before setting MPUSRC to '11'. */
#define RCC_MPCKSELR_MPUSRC_0                      (0x1UL << RCC_MPCKSELR_MPUSRC_Pos)                   /*!< 0x00000001 */
#define RCC_MPCKSELR_MPUSRC_1                      (0x2UL << RCC_MPCKSELR_MPUSRC_Pos)                   /*!< 0x00000002 */
#define RCC_MPCKSELR_MPUSRCRDY_Pos                 (31U)
#define RCC_MPCKSELR_MPUSRCRDY_Msk                 (0x1UL << RCC_MPCKSELR_MPUSRCRDY_Pos)                /*!< 0x80000000 */
#define RCC_MPCKSELR_MPUSRCRDY                     RCC_MPCKSELR_MPUSRCRDY_Msk                          /*!< MPU clock switch status Set and reset by hardware to indicate if the MPU clock switch transition has been properly performed. */

/****************  Bit definition for RCC_ASSCKSELR register  *****************/
#define RCC_ASSCKSELR_AXISSRC_Pos                  (0U)
#define RCC_ASSCKSELR_AXISSRC_Msk                  (0x7UL << RCC_ASSCKSELR_AXISSRC_Pos)                 /*!< 0x00000007 */
#define RCC_ASSCKSELR_AXISSRC                      RCC_ASSCKSELR_AXISSRC_Msk                           /*!< AXI sub-system clock switch Written by software to select the AXI sub-system clock source (axiss_ck). others: axiss_ck is gated */
#define RCC_ASSCKSELR_AXISSRC_0                    (0x1UL << RCC_ASSCKSELR_AXISSRC_Pos)                 /*!< 0x00000001 */
#define RCC_ASSCKSELR_AXISSRC_1                    (0x2UL << RCC_ASSCKSELR_AXISSRC_Pos)                 /*!< 0x00000002 */
#define RCC_ASSCKSELR_AXISSRC_2                    (0x4UL << RCC_ASSCKSELR_AXISSRC_Pos)                 /*!< 0x00000004 */
#define RCC_ASSCKSELR_AXISSRCRDY_Pos               (31U)
#define RCC_ASSCKSELR_AXISSRCRDY_Msk               (0x1UL << RCC_ASSCKSELR_AXISSRCRDY_Pos)              /*!< 0x80000000 */
#define RCC_ASSCKSELR_AXISSRCRDY                   RCC_ASSCKSELR_AXISSRCRDY_Msk                        /*!< AXI sub-system clock switch status Set and reset by hardware to indicate if the AXI clock switch transition has been properly performed. */

/****************  Bit definition for RCC_MSSCKSELR register  *****************/
#define RCC_MSSCKSELR_MLAHBSSRC_Pos                (0U)
#define RCC_MSSCKSELR_MLAHBSSRC_Msk                (0x3UL << RCC_MSSCKSELR_MLAHBSSRC_Pos)               /*!< 0x00000003 */
#define RCC_MSSCKSELR_MLAHBSSRC                    RCC_MSSCKSELR_MLAHBSSRC_Msk                         /*!< MLAHB sub-system clock switch Written by software to select the MLAHB sub-system clock source (mlahbss_ck). Reset by hardware in order to select hsi_ck when the system exits from one of the Stop modes. */
#define RCC_MSSCKSELR_MLAHBSSRC_0                  (0x1UL << RCC_MSSCKSELR_MLAHBSSRC_Pos)               /*!< 0x00000001 */
#define RCC_MSSCKSELR_MLAHBSSRC_1                  (0x2UL << RCC_MSSCKSELR_MLAHBSSRC_Pos)               /*!< 0x00000002 */
#define RCC_MSSCKSELR_MLAHBSSRCRDY_Pos             (31U)
#define RCC_MSSCKSELR_MLAHBSSRCRDY_Msk             (0x1UL << RCC_MSSCKSELR_MLAHBSSRCRDY_Pos)            /*!< 0x80000000 */
#define RCC_MSSCKSELR_MLAHBSSRCRDY                 RCC_MSSCKSELR_MLAHBSSRCRDY_Msk                      /*!< MLAHB sub-system clock switch status Set and reset by hardware to indicate if the MLAHB clock switch transition has been properly performed. */

/****************  Bit definition for RCC_CPERCKSELR register  ****************/
#define RCC_CPERCKSELR_CKPERSRC_Pos                (0U)
#define RCC_CPERCKSELR_CKPERSRC_Msk                (0x3UL << RCC_CPERCKSELR_CKPERSRC_Pos)               /*!< 0x00000003 */
#define RCC_CPERCKSELR_CKPERSRC                    RCC_CPERCKSELR_CKPERSRC_Msk                         /*!< Oscillator selection for kernel clock Set and cleared by software. */
#define RCC_CPERCKSELR_CKPERSRC_0                  (0x1UL << RCC_CPERCKSELR_CKPERSRC_Pos)               /*!< 0x00000001 */
#define RCC_CPERCKSELR_CKPERSRC_1                  (0x2UL << RCC_CPERCKSELR_CKPERSRC_Pos)               /*!< 0x00000002 */

