zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
/***************  Bit definition for RCC_APB6RSTSETR register  ****************/
#define RCC_APB6RSTSETR_USART1RST_Pos              (0U)
#define RCC_APB6RSTSETR_USART1RST_Msk              (0x1UL << RCC_APB6RSTSETR_USART1RST_Pos)             /*!< 0x00000001 */
#define RCC_APB6RSTSETR_USART1RST                  RCC_APB6RSTSETR_USART1RST_Msk                       /*!< USART1 block reset If USART1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_USART2RST_Pos              (1U)
#define RCC_APB6RSTSETR_USART2RST_Msk              (0x1UL << RCC_APB6RSTSETR_USART2RST_Pos)             /*!< 0x00000002 */
#define RCC_APB6RSTSETR_USART2RST                  RCC_APB6RSTSETR_USART2RST_Msk                       /*!< USART2 block reset If USART2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_SPI4RST_Pos                (2U)
#define RCC_APB6RSTSETR_SPI4RST_Msk                (0x1UL << RCC_APB6RSTSETR_SPI4RST_Pos)               /*!< 0x00000004 */
#define RCC_APB6RSTSETR_SPI4RST                    RCC_APB6RSTSETR_SPI4RST_Msk                         /*!< SPI4 block reset If SPI4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_SPI5RST_Pos                (3U)
#define RCC_APB6RSTSETR_SPI5RST_Msk                (0x1UL << RCC_APB6RSTSETR_SPI5RST_Pos)               /*!< 0x00000008 */
#define RCC_APB6RSTSETR_SPI5RST                    RCC_APB6RSTSETR_SPI5RST_Msk                         /*!< SPI5 block reset If SPI5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_I2C3RST_Pos                (4U)
#define RCC_APB6RSTSETR_I2C3RST_Msk                (0x1UL << RCC_APB6RSTSETR_I2C3RST_Pos)               /*!< 0x00000010 */
#define RCC_APB6RSTSETR_I2C3RST                    RCC_APB6RSTSETR_I2C3RST_Msk                         /*!< I2C3 block reset If I2C3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_I2C4RST_Pos                (5U)
#define RCC_APB6RSTSETR_I2C4RST_Msk                (0x1UL << RCC_APB6RSTSETR_I2C4RST_Pos)               /*!< 0x00000020 */
#define RCC_APB6RSTSETR_I2C4RST                    RCC_APB6RSTSETR_I2C4RST_Msk                         /*!< I2C4 block reset If I2C4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_I2C5RST_Pos                (6U)
#define RCC_APB6RSTSETR_I2C5RST_Msk                (0x1UL << RCC_APB6RSTSETR_I2C5RST_Pos)               /*!< 0x00000040 */
#define RCC_APB6RSTSETR_I2C5RST                    RCC_APB6RSTSETR_I2C5RST_Msk                         /*!< I2C5 block reset If I2C5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_TIM12RST_Pos               (7U)
#define RCC_APB6RSTSETR_TIM12RST_Msk               (0x1UL << RCC_APB6RSTSETR_TIM12RST_Pos)              /*!< 0x00000080 */
#define RCC_APB6RSTSETR_TIM12RST                   RCC_APB6RSTSETR_TIM12RST_Msk                        /*!< TIM12 block reset If TIM12 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_TIM13RST_Pos               (8U)
#define RCC_APB6RSTSETR_TIM13RST_Msk               (0x1UL << RCC_APB6RSTSETR_TIM13RST_Pos)              /*!< 0x00000100 */
#define RCC_APB6RSTSETR_TIM13RST                   RCC_APB6RSTSETR_TIM13RST_Msk                        /*!< TIM13 block reset If TIM13 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_TIM14RST_Pos               (9U)
#define RCC_APB6RSTSETR_TIM14RST_Msk               (0x1UL << RCC_APB6RSTSETR_TIM14RST_Pos)              /*!< 0x00000200 */
#define RCC_APB6RSTSETR_TIM14RST                   RCC_APB6RSTSETR_TIM14RST_Msk                        /*!< TIM14 block reset If TIM14 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_TIM15RST_Pos               (10U)
#define RCC_APB6RSTSETR_TIM15RST_Msk               (0x1UL << RCC_APB6RSTSETR_TIM15RST_Pos)              /*!< 0x00000400 */
#define RCC_APB6RSTSETR_TIM15RST                   RCC_APB6RSTSETR_TIM15RST_Msk                        /*!< TIM15 block reset If TIM15 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_TIM16RST_Pos               (11U)
#define RCC_APB6RSTSETR_TIM16RST_Msk               (0x1UL << RCC_APB6RSTSETR_TIM16RST_Pos)              /*!< 0x00000800 */
#define RCC_APB6RSTSETR_TIM16RST                   RCC_APB6RSTSETR_TIM16RST_Msk                        /*!< TIM16 block reset If TIM16 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTSETR_TIM17RST_Pos               (12U)
#define RCC_APB6RSTSETR_TIM17RST_Msk               (0x1UL << RCC_APB6RSTSETR_TIM17RST_Pos)              /*!< 0x00001000 */
#define RCC_APB6RSTSETR_TIM17RST                   RCC_APB6RSTSETR_TIM17RST_Msk                        /*!< TIM17 block reset If TIM17 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/***************  Bit definition for RCC_APB6RSTCLRR register  ****************/
#define RCC_APB6RSTCLRR_USART1RST_Pos              (0U)
#define RCC_APB6RSTCLRR_USART1RST_Msk              (0x1UL << RCC_APB6RSTCLRR_USART1RST_Pos)             /*!< 0x00000001 */
#define RCC_APB6RSTCLRR_USART1RST                  RCC_APB6RSTCLRR_USART1RST_Msk                       /*!< USART1 block reset If USART1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_USART2RST_Pos              (1U)
#define RCC_APB6RSTCLRR_USART2RST_Msk              (0x1UL << RCC_APB6RSTCLRR_USART2RST_Pos)             /*!< 0x00000002 */
#define RCC_APB6RSTCLRR_USART2RST                  RCC_APB6RSTCLRR_USART2RST_Msk                       /*!< USART2 block reset If USART2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_SPI4RST_Pos                (2U)
#define RCC_APB6RSTCLRR_SPI4RST_Msk                (0x1UL << RCC_APB6RSTCLRR_SPI4RST_Pos)               /*!< 0x00000004 */
#define RCC_APB6RSTCLRR_SPI4RST                    RCC_APB6RSTCLRR_SPI4RST_Msk                         /*!< SPI4 block reset If SPI4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_SPI5RST_Pos                (3U)
#define RCC_APB6RSTCLRR_SPI5RST_Msk                (0x1UL << RCC_APB6RSTCLRR_SPI5RST_Pos)               /*!< 0x00000008 */
#define RCC_APB6RSTCLRR_SPI5RST                    RCC_APB6RSTCLRR_SPI5RST_Msk                         /*!< SPI5 block reset If SPI5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_I2C3RST_Pos                (4U)
#define RCC_APB6RSTCLRR_I2C3RST_Msk                (0x1UL << RCC_APB6RSTCLRR_I2C3RST_Pos)               /*!< 0x00000010 */
#define RCC_APB6RSTCLRR_I2C3RST                    RCC_APB6RSTCLRR_I2C3RST_Msk                         /*!< I2C3 block reset If I2C3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_I2C4RST_Pos                (5U)
#define RCC_APB6RSTCLRR_I2C4RST_Msk                (0x1UL << RCC_APB6RSTCLRR_I2C4RST_Pos)               /*!< 0x00000020 */
#define RCC_APB6RSTCLRR_I2C4RST                    RCC_APB6RSTCLRR_I2C4RST_Msk                         /*!< I2C4 block reset If I2C4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_I2C5RST_Pos                (6U)
#define RCC_APB6RSTCLRR_I2C5RST_Msk                (0x1UL << RCC_APB6RSTCLRR_I2C5RST_Pos)               /*!< 0x00000040 */
#define RCC_APB6RSTCLRR_I2C5RST                    RCC_APB6RSTCLRR_I2C5RST_Msk                         /*!< I2C5 block reset If I2C5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_TIM12RST_Pos               (7U)
#define RCC_APB6RSTCLRR_TIM12RST_Msk               (0x1UL << RCC_APB6RSTCLRR_TIM12RST_Pos)              /*!< 0x00000080 */
#define RCC_APB6RSTCLRR_TIM12RST                   RCC_APB6RSTCLRR_TIM12RST_Msk                        /*!< TIM12 block reset If TIM12 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_TIM13RST_Pos               (8U)
#define RCC_APB6RSTCLRR_TIM13RST_Msk               (0x1UL << RCC_APB6RSTCLRR_TIM13RST_Pos)              /*!< 0x00000100 */
#define RCC_APB6RSTCLRR_TIM13RST                   RCC_APB6RSTCLRR_TIM13RST_Msk                        /*!< TIM13 block reset If TIM13 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_TIM14RST_Pos               (9U)
#define RCC_APB6RSTCLRR_TIM14RST_Msk               (0x1UL << RCC_APB6RSTCLRR_TIM14RST_Pos)              /*!< 0x00000200 */
#define RCC_APB6RSTCLRR_TIM14RST                   RCC_APB6RSTCLRR_TIM14RST_Msk                        /*!< TIM14 block reset If TIM14 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_TIM15RST_Pos               (10U)
#define RCC_APB6RSTCLRR_TIM15RST_Msk               (0x1UL << RCC_APB6RSTCLRR_TIM15RST_Pos)              /*!< 0x00000400 */
#define RCC_APB6RSTCLRR_TIM15RST                   RCC_APB6RSTCLRR_TIM15RST_Msk                        /*!< TIM15 block reset If TIM15 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_TIM16RST_Pos               (11U)
#define RCC_APB6RSTCLRR_TIM16RST_Msk               (0x1UL << RCC_APB6RSTCLRR_TIM16RST_Pos)              /*!< 0x00000800 */
#define RCC_APB6RSTCLRR_TIM16RST                   RCC_APB6RSTCLRR_TIM16RST_Msk                        /*!< TIM16 block reset If TIM16 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_APB6RSTCLRR_TIM17RST_Pos               (12U)
#define RCC_APB6RSTCLRR_TIM17RST_Msk               (0x1UL << RCC_APB6RSTCLRR_TIM17RST_Pos)              /*!< 0x00001000 */
#define RCC_APB6RSTCLRR_TIM17RST                   RCC_APB6RSTCLRR_TIM17RST_Msk                        /*!< TIM17 block reset If TIM17 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/***************  Bit definition for RCC_AHB2RSTSETR register  ****************/
#define RCC_AHB2RSTSETR_DMA1RST_Pos                (0U)
#define RCC_AHB2RSTSETR_DMA1RST_Msk                (0x1UL << RCC_AHB2RSTSETR_DMA1RST_Pos)               /*!< 0x00000001 */
#define RCC_AHB2RSTSETR_DMA1RST                    RCC_AHB2RSTSETR_DMA1RST_Msk                         /*!< DMA1 block reset Set by software. */
#define RCC_AHB2RSTSETR_DMA2RST_Pos                (1U)
#define RCC_AHB2RSTSETR_DMA2RST_Msk                (0x1UL << RCC_AHB2RSTSETR_DMA2RST_Pos)               /*!< 0x00000002 */
#define RCC_AHB2RSTSETR_DMA2RST                    RCC_AHB2RSTSETR_DMA2RST_Msk                         /*!< DMA2 block reset Set by software. */
#define RCC_AHB2RSTSETR_DMAMUX1RST_Pos             (2U)
#define RCC_AHB2RSTSETR_DMAMUX1RST_Msk             (0x1UL << RCC_AHB2RSTSETR_DMAMUX1RST_Pos)            /*!< 0x00000004 */
#define RCC_AHB2RSTSETR_DMAMUX1RST                 RCC_AHB2RSTSETR_DMAMUX1RST_Msk                      /*!< DMAMUX1 block reset Set by software. */
#define RCC_AHB2RSTSETR_DMA3RST_Pos                (3U)
#define RCC_AHB2RSTSETR_DMA3RST_Msk                (0x1UL << RCC_AHB2RSTSETR_DMA3RST_Pos)               /*!< 0x00000008 */
#define RCC_AHB2RSTSETR_DMA3RST                    RCC_AHB2RSTSETR_DMA3RST_Msk                         /*!< DMA3 block reset If DMA3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB2RSTSETR_DMAMUX2RST_Pos             (4U)
#define RCC_AHB2RSTSETR_DMAMUX2RST_Msk             (0x1UL << RCC_AHB2RSTSETR_DMAMUX2RST_Pos)            /*!< 0x00000010 */
#define RCC_AHB2RSTSETR_DMAMUX2RST                 RCC_AHB2RSTSETR_DMAMUX2RST_Msk                      /*!< DMAMUX2 block reset If DMAMUX2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB2RSTSETR_ADC1RST_Pos                (5U)
#define RCC_AHB2RSTSETR_ADC1RST_Msk                (0x1UL << RCC_AHB2RSTSETR_ADC1RST_Pos)               /*!< 0x00000020 */
#define RCC_AHB2RSTSETR_ADC1RST                    RCC_AHB2RSTSETR_ADC1RST_Msk                         /*!< ADC1 block reset If ADC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB2RSTSETR_ADC2RST_Pos                (6U)
#define RCC_AHB2RSTSETR_ADC2RST_Msk                (0x1UL << RCC_AHB2RSTSETR_ADC2RST_Pos)               /*!< 0x00000040 */
#define RCC_AHB2RSTSETR_ADC2RST                    RCC_AHB2RSTSETR_ADC2RST_Msk                         /*!< ADC2 block reset If ADC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB2RSTSETR_USBORST_Pos                (8U)
#define RCC_AHB2RSTSETR_USBORST_Msk                (0x1UL << RCC_AHB2RSTSETR_USBORST_Pos)               /*!< 0x00000100 */
#define RCC_AHB2RSTSETR_USBORST                    RCC_AHB2RSTSETR_USBORST_Msk                         /*!< USBO block reset If USBO is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/***************  Bit definition for RCC_AHB2RSTCLRR register  ****************/
#define RCC_AHB2RSTCLRR_DMA1RST_Pos                (0U)
#define RCC_AHB2RSTCLRR_DMA1RST_Msk                (0x1UL << RCC_AHB2RSTCLRR_DMA1RST_Pos)               /*!< 0x00000001 */
#define RCC_AHB2RSTCLRR_DMA1RST                    RCC_AHB2RSTCLRR_DMA1RST_Msk                         /*!< DMA1 block reset Cleared by software. */
#define RCC_AHB2RSTCLRR_DMA2RST_Pos                (1U)
#define RCC_AHB2RSTCLRR_DMA2RST_Msk                (0x1UL << RCC_AHB2RSTCLRR_DMA2RST_Pos)               /*!< 0x00000002 */
#define RCC_AHB2RSTCLRR_DMA2RST                    RCC_AHB2RSTCLRR_DMA2RST_Msk                         /*!< DMA2 block reset Cleared by software. */
#define RCC_AHB2RSTCLRR_DMAMUX1RST_Pos             (2U)
#define RCC_AHB2RSTCLRR_DMAMUX1RST_Msk             (0x1UL << RCC_AHB2RSTCLRR_DMAMUX1RST_Pos)            /*!< 0x00000004 */
#define RCC_AHB2RSTCLRR_DMAMUX1RST                 RCC_AHB2RSTCLRR_DMAMUX1RST_Msk                      /*!< DMAMUX1 block reset Cleared by software. */
#define RCC_AHB2RSTCLRR_DMA3RST_Pos                (3U)
#define RCC_AHB2RSTCLRR_DMA3RST_Msk                (0x1UL << RCC_AHB2RSTCLRR_DMA3RST_Pos)               /*!< 0x00000008 */
#define RCC_AHB2RSTCLRR_DMA3RST                    RCC_AHB2RSTCLRR_DMA3RST_Msk                         /*!< DMA3 block reset If DMA3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB2RSTCLRR_DMAMUX2RST_Pos             (4U)
#define RCC_AHB2RSTCLRR_DMAMUX2RST_Msk             (0x1UL << RCC_AHB2RSTCLRR_DMAMUX2RST_Pos)            /*!< 0x00000010 */
#define RCC_AHB2RSTCLRR_DMAMUX2RST                 RCC_AHB2RSTCLRR_DMAMUX2RST_Msk                      /*!< DMAMUX2 block reset If DMAMUX2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB2RSTCLRR_ADC1RST_Pos                (5U)
#define RCC_AHB2RSTCLRR_ADC1RST_Msk                (0x1UL << RCC_AHB2RSTCLRR_ADC1RST_Pos)               /*!< 0x00000020 */
#define RCC_AHB2RSTCLRR_ADC1RST                    RCC_AHB2RSTCLRR_ADC1RST_Msk                         /*!< ADC1 block reset If ADC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB2RSTCLRR_ADC2RST_Pos                (6U)
#define RCC_AHB2RSTCLRR_ADC2RST_Msk                (0x1UL << RCC_AHB2RSTCLRR_ADC2RST_Pos)               /*!< 0x00000040 */
#define RCC_AHB2RSTCLRR_ADC2RST                    RCC_AHB2RSTCLRR_ADC2RST_Msk                         /*!< ADC2 block reset If ADC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB2RSTCLRR_USBORST_Pos                (8U)
#define RCC_AHB2RSTCLRR_USBORST_Msk                (0x1UL << RCC_AHB2RSTCLRR_USBORST_Pos)               /*!< 0x00000100 */
#define RCC_AHB2RSTCLRR_USBORST                    RCC_AHB2RSTCLRR_USBORST_Msk                         /*!< USBO block reset If USBO is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

