zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133dxx_ca7.h
/**************  Bit definition for RCC_MP_APB2ENCLRR register  ***************/
#define RCC_MP_APB2ENCLRR_TIM1EN_Pos               (0U)
#define RCC_MP_APB2ENCLRR_TIM1EN_Msk               (0x1UL << RCC_MP_APB2ENCLRR_TIM1EN_Pos)              /*!< 0x00000001 */
#define RCC_MP_APB2ENCLRR_TIM1EN                   RCC_MP_APB2ENCLRR_TIM1EN_Msk                        /*!< TIM1 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_TIM8EN_Pos               (1U)
#define RCC_MP_APB2ENCLRR_TIM8EN_Msk               (0x1UL << RCC_MP_APB2ENCLRR_TIM8EN_Pos)              /*!< 0x00000002 */
#define RCC_MP_APB2ENCLRR_TIM8EN                   RCC_MP_APB2ENCLRR_TIM8EN_Msk                        /*!< TIM8 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_SPI1EN_Pos               (8U)
#define RCC_MP_APB2ENCLRR_SPI1EN_Msk               (0x1UL << RCC_MP_APB2ENCLRR_SPI1EN_Pos)              /*!< 0x00000100 */
#define RCC_MP_APB2ENCLRR_SPI1EN                   RCC_MP_APB2ENCLRR_SPI1EN_Msk                        /*!< SPI/I2S1 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_USART6EN_Pos             (13U)
#define RCC_MP_APB2ENCLRR_USART6EN_Msk             (0x1UL << RCC_MP_APB2ENCLRR_USART6EN_Pos)            /*!< 0x00002000 */
#define RCC_MP_APB2ENCLRR_USART6EN                 RCC_MP_APB2ENCLRR_USART6EN_Msk                      /*!< USART6 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_SAI1EN_Pos               (16U)
#define RCC_MP_APB2ENCLRR_SAI1EN_Msk               (0x1UL << RCC_MP_APB2ENCLRR_SAI1EN_Pos)              /*!< 0x00010000 */
#define RCC_MP_APB2ENCLRR_SAI1EN                   RCC_MP_APB2ENCLRR_SAI1EN_Msk                        /*!< SAI1 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_SAI2EN_Pos               (17U)
#define RCC_MP_APB2ENCLRR_SAI2EN_Msk               (0x1UL << RCC_MP_APB2ENCLRR_SAI2EN_Pos)              /*!< 0x00020000 */
#define RCC_MP_APB2ENCLRR_SAI2EN                   RCC_MP_APB2ENCLRR_SAI2EN_Msk                        /*!< SAI2 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_DFSDMEN_Pos              (20U)
#define RCC_MP_APB2ENCLRR_DFSDMEN_Msk              (0x1UL << RCC_MP_APB2ENCLRR_DFSDMEN_Pos)             /*!< 0x00100000 */
#define RCC_MP_APB2ENCLRR_DFSDMEN                  RCC_MP_APB2ENCLRR_DFSDMEN_Msk                       /*!< DFSDM peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_ADFSDMEN_Pos             (21U)
#define RCC_MP_APB2ENCLRR_ADFSDMEN_Msk             (0x1UL << RCC_MP_APB2ENCLRR_ADFSDMEN_Pos)            /*!< 0x00200000 */
#define RCC_MP_APB2ENCLRR_ADFSDMEN                 RCC_MP_APB2ENCLRR_ADFSDMEN_Msk                      /*!< Audio DFSDM peripheral clocks enable Cleared by software. */
#define RCC_MP_APB2ENCLRR_FDCANEN_Pos              (24U)
#define RCC_MP_APB2ENCLRR_FDCANEN_Msk              (0x1UL << RCC_MP_APB2ENCLRR_FDCANEN_Pos)             /*!< 0x01000000 */
#define RCC_MP_APB2ENCLRR_FDCANEN                  RCC_MP_APB2ENCLRR_FDCANEN_Msk                       /*!< FDCAN and CANRAM peripheral clocks enable Cleared by software. */

/**************  Bit definition for RCC_MP_APB3ENSETR register  ***************/
#define RCC_MP_APB3ENSETR_LPTIM2EN_Pos             (0U)
#define RCC_MP_APB3ENSETR_LPTIM2EN_Msk             (0x1UL << RCC_MP_APB3ENSETR_LPTIM2EN_Pos)            /*!< 0x00000001 */
#define RCC_MP_APB3ENSETR_LPTIM2EN                 RCC_MP_APB3ENSETR_LPTIM2EN_Msk                      /*!< LPTIM2 peripheral clocks enable If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB3ENSETR_LPTIM3EN_Pos             (1U)
#define RCC_MP_APB3ENSETR_LPTIM3EN_Msk             (0x1UL << RCC_MP_APB3ENSETR_LPTIM3EN_Pos)            /*!< 0x00000002 */
#define RCC_MP_APB3ENSETR_LPTIM3EN                 RCC_MP_APB3ENSETR_LPTIM3EN_Msk                      /*!< LPTIM3 peripheral clocks enable If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB3ENSETR_LPTIM4EN_Pos             (2U)
#define RCC_MP_APB3ENSETR_LPTIM4EN_Msk             (0x1UL << RCC_MP_APB3ENSETR_LPTIM4EN_Pos)            /*!< 0x00000004 */
#define RCC_MP_APB3ENSETR_LPTIM4EN                 RCC_MP_APB3ENSETR_LPTIM4EN_Msk                      /*!< LPTIM4 peripheral clocks enable Set by software. */
#define RCC_MP_APB3ENSETR_LPTIM5EN_Pos             (3U)
#define RCC_MP_APB3ENSETR_LPTIM5EN_Msk             (0x1UL << RCC_MP_APB3ENSETR_LPTIM5EN_Pos)            /*!< 0x00000008 */
#define RCC_MP_APB3ENSETR_LPTIM5EN                 RCC_MP_APB3ENSETR_LPTIM5EN_Msk                      /*!< LPTIM5 peripheral clocks enable Set by software. */
#define RCC_MP_APB3ENSETR_VREFEN_Pos               (13U)
#define RCC_MP_APB3ENSETR_VREFEN_Msk               (0x1UL << RCC_MP_APB3ENSETR_VREFEN_Pos)              /*!< 0x00002000 */
#define RCC_MP_APB3ENSETR_VREFEN                   RCC_MP_APB3ENSETR_VREFEN_Msk                        /*!< VREF peripheral clocks enable If VREF block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB3ENSETR_DTSEN_Pos                (16U)
#define RCC_MP_APB3ENSETR_DTSEN_Msk                (0x1UL << RCC_MP_APB3ENSETR_DTSEN_Pos)               /*!< 0x00010000 */
#define RCC_MP_APB3ENSETR_DTSEN                    RCC_MP_APB3ENSETR_DTSEN_Msk                         /*!< DTS peripheral clocks enable Set by software. */
#define RCC_MP_APB3ENSETR_PMBCTRLEN_Pos            (17U)
#define RCC_MP_APB3ENSETR_PMBCTRLEN_Msk            (0x1UL << RCC_MP_APB3ENSETR_PMBCTRLEN_Pos)           /*!< 0x00020000 */
#define RCC_MP_APB3ENSETR_PMBCTRLEN                RCC_MP_APB3ENSETR_PMBCTRLEN_Msk                     /*!< PMBCTRL peripheral clocks enable (non-user): this bit is present in the RTL and is internally used as: SPIRIT parameter RTLPRESENT */
#define RCC_MP_APB3ENSETR_HDPEN_Pos                (20U)
#define RCC_MP_APB3ENSETR_HDPEN_Msk                (0x1UL << RCC_MP_APB3ENSETR_HDPEN_Pos)               /*!< 0x00100000 */
#define RCC_MP_APB3ENSETR_HDPEN                    RCC_MP_APB3ENSETR_HDPEN_Msk                         /*!< HDP peripheral clocks enable Set by software. */

/**************  Bit definition for RCC_MP_APB3ENCLRR register  ***************/
#define RCC_MP_APB3ENCLRR_LPTIM2EN_Pos             (0U)
#define RCC_MP_APB3ENCLRR_LPTIM2EN_Msk             (0x1UL << RCC_MP_APB3ENCLRR_LPTIM2EN_Pos)            /*!< 0x00000001 */
#define RCC_MP_APB3ENCLRR_LPTIM2EN                 RCC_MP_APB3ENCLRR_LPTIM2EN_Msk                      /*!< LPTIM2 peripheral clocks enable If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB3ENCLRR_LPTIM3EN_Pos             (1U)
#define RCC_MP_APB3ENCLRR_LPTIM3EN_Msk             (0x1UL << RCC_MP_APB3ENCLRR_LPTIM3EN_Pos)            /*!< 0x00000002 */
#define RCC_MP_APB3ENCLRR_LPTIM3EN                 RCC_MP_APB3ENCLRR_LPTIM3EN_Msk                      /*!< LPTIM3 peripheral clocks enable If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB3ENCLRR_LPTIM4EN_Pos             (2U)
#define RCC_MP_APB3ENCLRR_LPTIM4EN_Msk             (0x1UL << RCC_MP_APB3ENCLRR_LPTIM4EN_Pos)            /*!< 0x00000004 */
#define RCC_MP_APB3ENCLRR_LPTIM4EN                 RCC_MP_APB3ENCLRR_LPTIM4EN_Msk                      /*!< LPTIM4 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB3ENCLRR_LPTIM5EN_Pos             (3U)
#define RCC_MP_APB3ENCLRR_LPTIM5EN_Msk             (0x1UL << RCC_MP_APB3ENCLRR_LPTIM5EN_Pos)            /*!< 0x00000008 */
#define RCC_MP_APB3ENCLRR_LPTIM5EN                 RCC_MP_APB3ENCLRR_LPTIM5EN_Msk                      /*!< LPTIM5 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB3ENCLRR_VREFEN_Pos               (13U)
#define RCC_MP_APB3ENCLRR_VREFEN_Msk               (0x1UL << RCC_MP_APB3ENCLRR_VREFEN_Pos)              /*!< 0x00002000 */
#define RCC_MP_APB3ENCLRR_VREFEN                   RCC_MP_APB3ENCLRR_VREFEN_Msk                        /*!< VREF peripheral clocks enable If VREF block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB3ENCLRR_DTSEN_Pos                (16U)
#define RCC_MP_APB3ENCLRR_DTSEN_Msk                (0x1UL << RCC_MP_APB3ENCLRR_DTSEN_Pos)               /*!< 0x00010000 */
#define RCC_MP_APB3ENCLRR_DTSEN                    RCC_MP_APB3ENCLRR_DTSEN_Msk                         /*!< DTS peripheral clocks enable Cleared by software. */
#define RCC_MP_APB3ENCLRR_PMBCTRLEN_Pos            (17U)
#define RCC_MP_APB3ENCLRR_PMBCTRLEN_Msk            (0x1UL << RCC_MP_APB3ENCLRR_PMBCTRLEN_Pos)           /*!< 0x00020000 */
#define RCC_MP_APB3ENCLRR_PMBCTRLEN                RCC_MP_APB3ENCLRR_PMBCTRLEN_Msk                     /*!< PMBCTRL peripheral clocks enable (non-user): this bit is present in the RTL and is internally used as: SPIRIT parameter RTLPRESENT */
#define RCC_MP_APB3ENCLRR_HDPEN_Pos                (20U)
#define RCC_MP_APB3ENCLRR_HDPEN_Msk                (0x1UL << RCC_MP_APB3ENCLRR_HDPEN_Pos)               /*!< 0x00100000 */
#define RCC_MP_APB3ENCLRR_HDPEN                    RCC_MP_APB3ENCLRR_HDPEN_Msk                         /*!< HDP peripheral clocks enable Cleared by software. */

/*************  Bit definition for RCC_MP_S_APB3ENSETR register  **************/
#define RCC_MP_S_APB3ENSETR_SYSCFGEN_Pos           (0U)
#define RCC_MP_S_APB3ENSETR_SYSCFGEN_Msk           (0x1UL << RCC_MP_S_APB3ENSETR_SYSCFGEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_S_APB3ENSETR_SYSCFGEN               RCC_MP_S_APB3ENSETR_SYSCFGEN_Msk                    /*!< SYSCFG peripheral clocks enable Set by (secure) software. */

/*************  Bit definition for RCC_MP_S_APB3ENCLRR register  **************/
#define RCC_MP_S_APB3ENCLRR_SYSCFGEN_Pos           (0U)
#define RCC_MP_S_APB3ENCLRR_SYSCFGEN_Msk           (0x1UL << RCC_MP_S_APB3ENCLRR_SYSCFGEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_S_APB3ENCLRR_SYSCFGEN               RCC_MP_S_APB3ENCLRR_SYSCFGEN_Msk                    /*!< SYSCFG peripheral clocks enable Cleared by (secure) software. */

/*************  Bit definition for RCC_MP_NS_APB3ENSETR register  *************/
#define RCC_MP_NS_APB3ENSETR_SYSCFGEN_Pos          (0U)
#define RCC_MP_NS_APB3ENSETR_SYSCFGEN_Msk          (0x1UL << RCC_MP_NS_APB3ENSETR_SYSCFGEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_NS_APB3ENSETR_SYSCFGEN              RCC_MP_NS_APB3ENSETR_SYSCFGEN_Msk                   /*!< SYSCFG peripheral clocks enable Set by software. */

/*************  Bit definition for RCC_MP_NS_APB3ENCLRR register  *************/
#define RCC_MP_NS_APB3ENCLRR_SYSCFGEN_Pos          (0U)
#define RCC_MP_NS_APB3ENCLRR_SYSCFGEN_Msk          (0x1UL << RCC_MP_NS_APB3ENCLRR_SYSCFGEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_NS_APB3ENCLRR_SYSCFGEN              RCC_MP_NS_APB3ENCLRR_SYSCFGEN_Msk                   /*!< SYSCFG peripheral clocks enable Cleared by software. */

